config.org
#+TITLE: Literate doom-emacs config
#+AUTHOR: Rohit Goswami (HaoZeke) <rohit.goswami@aol.com>
#+PROPERTY: header-args :tangle yes
#+OPTIONS: toc:nil

** Table of Contents :noexport:TOC_3_gh:
  - [[#about][About]]
    - [[#about-that-toc][About that TOC..]]
  - [[#personal-information][Personal Information]]
  - [[#doom-emacs-stuff][Doom Emacs Stuff]]
    - [[#visual-tweaks][Visual tweaks]]
    - [[#helm-changes][Helm changes]]
    - [[#kill-spellcheck][Kill spellcheck]]
    - [[#kill-over-eager-literate-after-save-hook][Kill over-eager literate after-save-hook]]
  - [[#package-settings][Package Settings]]
    - [[#magit-aids][Magit Aids]]
    - [[#saltstack-settings][SaltStack Settings]]
  - [[#anki-editor][Anki Editor]]
  - [[#keybindings][Keybindings]]
    - [[#general][General]]
    - [[#evil-setup-and-error-handling][Evil Setup and Error Handling]]
    - [[#spacemacs-equivalency][Spacemacs Equivalency]]
    - [[#global-maps][Global Maps]]
    - [[#markdown-improvements][Markdown Improvements]]
    - [[#org-noter][Org Noter]]
    - [[#pdf-mode][Pdf Mode]]
    - [[#org-mode-additions][Org Mode additions]]
    - [[#anki-editor-1][Anki Editor]]
    - [[#cc-mode][CC Mode]]
    - [[#evil-movement][Evil Movement]]
    - [[#neotree----treemacs][Neotree --> Treemacs]]
    - [[#tex-mode][TeX Mode]]
  - [[#org-additions][Org Additions]]
    - [[#file-handling][File Handling]]
    - [[#ob-julia][Ob-Julia]]
    - [[#org-babel][Org Babel]]
    - [[#org-config][Org Config]]
    - [[#org-rifle][Org Rifle]]
    - [[#org-mind-map][Org Mind Map]]
    - [[#org-download][Org Download]]
    - [[#org-drill][Org Drill]]
  - [[#syntax-highlighting][Syntax Highlighting]]
    - [[#direnv-highlighting][Direnv Highlighting]]
    - [[#pkgbuild-mode][PKGBUILD Mode]]
    - [[#lammps-mode][LAMMPS Mode]]
    - [[#pug-mode][Pug Mode]]
    - [[#conf-mode-files][Conf Mode Files]]
    - [[#fortran][FORTRAN]]
    - [[#jvm-languages][JVM Languages]]
    - [[#systemd][Systemd]]
    - [[#dart-mode][Dart Mode]]
  - [[#aesthetics][Aesthetics]]
  - [[#dockerfile-mode][Dockerfile Mode]]
  - [[#functions][Functions]]
    - [[#org-mode-export-pdf-when-saved][Org-mode export pdf when saved]]
    - [[#org-mode-export-tex-when-saved][Org-mode export tex when saved]]
    - [[#caveats][Caveats]]
    - [[#helper-function][Helper function]]
    - [[#async-command-without-buffers][Async Command without Buffers]]
    - [[#smarter-clang-formatting][Smarter Clang Formatting]]
    - [[#org-mode-export-to-markdown][Org-mode export to Markdown]]
  - [[#projects][Projects]]
    - [[#dotdoom][dotDoom]]
  - [[#hooks][Hooks]]
    - [[#caveats-1][Caveats]]
    - [[#before-save-hooks][Before Save Hooks]]
    - [[#disable-auto-rdm][Disable Auto RDM]]
  - [[#safe-evals-and-variables][Safe Evals and Variables]]
    - [[#private-variables][Private Variables]]
    - [[#safe-variables][Safe Variables]]
    - [[#safe-evals][Safe Evals]]
    - [[#asynchronous-exports][Asynchronous Exports]]
  - [[#troubleshooting][Troubleshooting]]
- [[#org-latex][Org LaTeX]]
    - [[#async-config][Async Config]]
    - [[#config][Config]]
  - [[#shared-preferences][Shared Preferences]]
    - [[#compiler][Compiler]]
    - [[#packages][Packages]]
  - [[#export-templates][Export Templates]]
    - [[#koma-article][KOMA Article]]
    - [[#tufte-book][Tufte Book]]
  - [[#latex-preview-for-org-mode][LaTeX Preview for Org mode]]
  - [[#math-support][Math support]]
  - [[#flycheck-additions][Flycheck Additions]]
    - [[#melpa-helpers][MELPA Helpers]]
  - [[#references][References]]
    - [[#basic-setup][Basic Setup]]
    - [[#noteyoda][noteYoda]]
    - [[#reftex][Reftex]]
    - [[#org-ref-ivy][+Org Ref Ivy+]]
- [[#notes][Notes]]
  - [[#org-capture][Org Capture]]
    - [[#functions-1][Functions]]
    - [[#templates][Templates]]

** About
This is a literate config file for [[https://github.com/hlissner/doom-emacs][doom-emacs]] by ~hlinssner~. This is meant to
be used with the =develop= branch. Much of the basic setup is pulled from the
[[https://github.com/gilbertw1/emacs-literate-starter][emacs literate starter]] by =gilbertw1=. The [[file:packages.org][companion packages page]] describes the
basic package setup, while the ~init.el~ is described on [[file:index.html][the project homepage]].

*** About that TOC..
So as mentioned [[https:https://github.com/snosov1/toc-org/issues/35][here]] there is trouble when ~org-export~ tries to create files
while keeping the ~org-toc~ tag.

It's not really a problem since ~org-export~ actually generates a TOC for the
files anyway.

** Personal Information
Let's set some variables with basic user information.
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Rohit Goswami (HaoZeke)"
      user-mail-address "rohit.goswami@aol.com")
#+END_SRC
** Doom Emacs Stuff
*** Visual tweaks
**** Font Face
Honestly the basic font setting is simply not pretty enough.
#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "Attribute Mono" :size 20))
(unless (find-font doom-font)
  (setq doom-font (font-spec :family "Fira Mono" :size 20)))
#+END_SRC
