docs/config.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-28 Thu 17:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Literate doom-emacs config</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rohit Goswami (HaoZeke) &lt;rohit.goswami@aol.com&gt;" />
<link rel="stylesheet" type="text/css" href="https://thomasf.github.io/solarized-css/solarized-dark.min.css" />


</head>
<body>
<div id="content">
<h1 class="title">Literate doom-emacs config</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1eddb33">0.1. About</a>
<ul>
<li><a href="#org7200255">0.1.1. About that TOC..</a></li>
</ul>
</li>
<li><a href="#orgcd01b22">0.2. Personal Information</a></li>
<li><a href="#orgb61ba87">0.3. Doom Emacs Stuff</a>
<ul>
<li><a href="#orgbf9cc3d">0.3.1. Visual tweaks</a></li>
<li><a href="#orgb7c2d54">0.3.2. Helm changes</a></li>
<li><a href="#orgb5a3748">0.3.3. Kill spellcheck</a></li>
<li><a href="#org8aa4938">0.3.4. Kill over-eager literate after-save-hook</a></li>
</ul>
</li>
<li><a href="#org5dfd2c8">0.4. Package Settings</a>
<ul>
<li><a href="#org90b5f94">0.4.1. Magit Aids</a></li>
<li><a href="#orgb90e9da">0.4.2. SaltStack Settings</a></li>
</ul>
</li>
<li><a href="#org91fbb5c">0.5. Anki Editor</a></li>
<li><a href="#org98611ef">0.6. Keybindings</a>
<ul>
<li><a href="#orgbb80efe">0.6.1. <span class="done DONE">DONE</span> General</a></li>
<li><a href="#org23bfc3e">0.6.2. Evil Setup and Error Handling</a></li>
<li><a href="#orgaf66284">0.6.3. Spacemacs Equivalency</a></li>
<li><a href="#orgc5e38b9">0.6.4. Global Maps</a></li>
<li><a href="#org3a2329a">0.6.5. Markdown Improvements</a></li>
<li><a href="#org41bc970">0.6.6. Org Noter</a></li>
<li><a href="#orgb5632bd">0.6.7. Pdf Mode</a></li>
<li><a href="#org722197a">0.6.8. Org Mode additions</a></li>
<li><a href="#org427097d">0.6.9. Anki Editor</a></li>
<li><a href="#orgd755ca1">0.6.10. CC Mode</a></li>
<li><a href="#org357ed44">0.6.11. Evil Movement</a></li>
<li><a href="#org48f2af6">0.6.12. <span class="done DONE">DONE</span> Neotree &#x2013;&gt; Treemacs</a></li>
<li><a href="#org9739d63">0.6.13. TeX Mode</a></li>
</ul>
</li>
<li><a href="#org226f08e">0.7. Org Additions</a>
<ul>
<li><a href="#org493c31f">0.7.1. File Handling</a></li>
<li><a href="#org87a2cd8">0.7.2. Ob-Julia</a></li>
<li><a href="#orge755a4b">0.7.3. Org Babel</a></li>
<li><a href="#org6a306c8">0.7.4. Org Config</a></li>
<li><a href="#org9033e1a">0.7.5. Org Rifle</a></li>
<li><a href="#orge34065d">0.7.6. Org Mind Map</a></li>
<li><a href="#orgf8b7e0d">0.7.7. Org Download</a></li>
<li><a href="#org36d2160">0.7.8. Org Drill</a></li>
</ul>
</li>
<li><a href="#orgeda843c">0.8. Syntax Highlighting</a>
<ul>
<li><a href="#org96856e8">0.8.1. <span class="todo TODO">TODO</span> Direnv Highlighting</a></li>
<li><a href="#org53b214a">0.8.2. PKGBUILD Mode</a></li>
<li><a href="#org1656035">0.8.3. LAMMPS Mode</a></li>
<li><a href="#orgd3f5fcd">0.8.4. Pug Mode</a></li>
<li><a href="#orgdc4cd6a">0.8.5. Conf Mode Files</a></li>
<li><a href="#org3496f18">0.8.6. FORTRAN</a></li>
<li><a href="#org5874056">0.8.7. JVM Languages</a></li>
<li><a href="#orgd711f0c">0.8.8. Systemd</a></li>
<li><a href="#org5e52ca2">0.8.9. Dart Mode</a></li>
</ul>
</li>
<li><a href="#org3c1e574">0.9. Aesthetics</a></li>
<li><a href="#orge7b50f3">0.10. Dockerfile Mode</a></li>
<li><a href="#org8d70011">0.11. Functions</a>
<ul>
<li><a href="#org8a5c928">0.11.1. Org-mode export pdf when saved</a></li>
<li><a href="#org724e90d">0.11.2. Org-mode export tex when saved</a></li>
<li><a href="#org919841e">0.11.3. <span class="todo TODO">TODO</span> Caveats</a></li>
<li><a href="#org8ecd5f2">0.11.4. Helper function</a></li>
<li><a href="#org62e815e">0.11.5. Async Command without Buffers</a></li>
<li><a href="#org7f30cb0">0.11.6. Smarter Clang Formatting</a></li>
<li><a href="#org4e62a4a">0.11.7. Org-mode export to Markdown</a></li>
</ul>
</li>
<li><a href="#orgb7d9fc0">0.12. Projects</a>
<ul>
<li><a href="#orgc611b66">0.12.1. dotDoom</a></li>
</ul>
</li>
<li><a href="#org6bddc24">0.13. Hooks</a>
<ul>
<li><a href="#org45d4db7">0.13.1. <span class="todo TODO">TODO</span> Caveats</a></li>
<li><a href="#org9691e89">0.13.2. Before Save Hooks</a></li>
<li><a href="#orga42b48e">0.13.3. Disable Auto RDM</a></li>
</ul>
</li>
<li><a href="#orgeeff14f">0.14. Safe Evals and Variables</a>
<ul>
<li><a href="#org17861b6">0.14.1. Private Variables</a></li>
<li><a href="#org8d9a60f">0.14.2. Safe Variables</a></li>
<li><a href="#orgae7bc62">0.14.3. <span class="todo TODO">TODO</span> Safe Evals</a></li>
<li><a href="#org5cdef66">0.14.4. Asynchronous Exports</a></li>
</ul>
</li>
<li><a href="#orge0792f8">0.15. Troubleshooting</a></li>
</ul>
</li>
<li><a href="#orgf6a24e4">1. Org LaTeX</a>
<ul>
<li><a href="#orgf6b2d9a">1.1. Shared Preferences</a>
<ul>
<li><a href="#org42d0ef9">1.1.1. Compiler</a></li>
<li><a href="#orgae00d98">1.1.2. Packages</a></li>
</ul>
</li>
<li><a href="#org9282024">1.2. Export Templates</a>
<ul>
<li><a href="#org27ff887">1.2.1. KOMA Article</a></li>
<li><a href="#org6490fac">1.2.2. Tufte Book</a></li>
</ul>
</li>
<li><a href="#org39bdb65">1.3. LaTeX Preview for Org mode</a></li>
<li><a href="#org09cb540">1.4. Math support</a></li>
<li><a href="#org1629e30">1.5. Flycheck Additions</a>
<ul>
<li><a href="#orgaeee7d4">1.5.1. MELPA Helpers</a></li>
</ul>
</li>
<li><a href="#org4cbb38d">1.6. <span class="todo TODO">TODO</span> References</a>
<ul>
<li><a href="#orgac30cb0">1.6.1. Basic Setup</a></li>
<li><a href="#org86f537e">1.6.2. noteYoda</a></li>
<li><a href="#orgff1b695">1.6.3. Reftex</a></li>
<li><a href="#org7e29d98">1.6.4. <del>Org Ref Ivy</del></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2faa771">2. Notes</a>
<ul>
<li><a href="#orge97166c">2.1. Org Capture</a>
<ul>
<li><a href="#orgb586ff5">2.1.1. Functions</a></li>
<li><a href="#org9a3a42e">2.1.2. Templates</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1eddb33" class="outline-3">
<h3 id="org1eddb33"><span class="section-number-3">0.1</span> About</h3>
<div class="outline-text-3" id="text-0-1">
<p>
This is a literate config file for <a href="https://github.com/hlissner/doom-emacs">doom-emacs</a> by <code>hlinssner</code>. This is meant to
be used with the <code>develop</code> branch. Much of the basic setup is pulled from the
<a href="https://github.com/gilbertw1/emacs-literate-starter">emacs literate starter</a> by <code>gilbertw1</code>. The <a href="packages.html">companion packages page</a> describes the
basic package setup, while the <code>init.el</code> is described on <a href="index.html">the project homepage</a>.
</p>
</div>

<div id="outline-container-org7200255" class="outline-4">
<h4 id="org7200255"><span class="section-number-4">0.1.1</span> About that TOC..</h4>
<div class="outline-text-4" id="text-0-1-1">
<p>
So as mentioned <a href="https:https://github.com/snosov1/toc-org/issues/35">here</a> there is trouble when <code>org-export</code> tries to create files
while keeping the <code>org-toc</code> tag.
</p>

<p>
It&rsquo;s not really a problem since <code>org-export</code> actually generates a TOC for the
files anyway.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcd01b22" class="outline-3">
<h3 id="orgcd01b22"><span class="section-number-3">0.2</span> Personal Information</h3>
<div class="outline-text-3" id="text-0-2">
<p>
Let&rsquo;s set some variables with basic user information.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">user-full-name</span> <span style="color: #98be65;">"Rohit Goswami (HaoZeke)"</span>
      <span style="color: #dcaeea;">user-mail-address</span> <span style="color: #98be65;">"rohit.goswami@aol.com"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb61ba87" class="outline-3">
<h3 id="orgb61ba87"><span class="section-number-3">0.3</span> Doom Emacs Stuff</h3>
<div class="outline-text-3" id="text-0-3">
</div>
<div id="outline-container-orgbf9cc3d" class="outline-4">
<h4 id="orgbf9cc3d"><span class="section-number-4">0.3.1</span> Visual tweaks</h4>
<div class="outline-text-4" id="text-0-3-1">
</div>
<ol class="org-ol">
<li><a id="org42c2a27"></a>Font Face<br />
<div class="outline-text-5" id="text-0-3-1-1">
<p>
Honestly the basic font setting is simply not pretty enough.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">doom-font</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">font-spec</span> <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"Attribute Mono"</span> <span style="color: #c678dd;">:size</span> <span style="color: #da8548; font-weight: bold;">20</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">unless</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">find-font</span> <span style="color: #dcaeea;">doom-font</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">doom-font</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">font-spec</span> <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"FuraCode Nerd Font"</span> <span style="color: #c678dd;">:size</span> <span style="color: #da8548; font-weight: bold;">20</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
