config.org
**** Unicode Fonts
This should be implemented as fallback font once [[https://github.com/hlissner/doom-emacs/pull/861][this]] is merged.
#+BEGIN_SRC emacs-lisp
(setq doom-unicode-font (font-spec :name "DejaVu Sans Mono" :size 20))

#+END_SRC
**** Helm and Childframes
I prefer the regular diminished font size, even for the childframes.
#+BEGIN_SRC emacs-lisp
;; Undo the helm text enlargement in childframes
(setq +helm-posframe-text-scale 0)
#+END_SRC
**** Saner Dashboard
I have trouble at work with the current DOOM dashboard. This one is from the
~doom-emacs~ lead developer, as found on Discord.
#+BEGIN_SRC emacs-lisp
(setq +doom-dashboard-banner-file (expand-file-name "banner.png" doom-private-dir))
#+END_SRC
*** Helm changes
This makes `helm` behave more like `ivy` while working with directories.
#+BEGIN_SRC emacs-lisp :tangle no
(after! helm
  ;; I want backspace to go up a level, like ivy
  (add-hook! 'helm-find-files-after-init-hook
    (map! :map helm-find-files-map
          "<DEL>" #'helm-find-files-up-one-level)))
#+END_SRC
*** Kill spellcheck
This is really really really excruciatingly slow for LaTeX mode and maybe even
for other random buffers.
#+BEGIN_SRC emacs-lisp
(setq-hook! 'LaTeX-mode-hook +spellcheck-immediately nil)
#+END_SRC
**** Snippets
I am not sure if these need to be initialized.
#+BEGIN_SRC emacs-lisp
; hlissner
(use-package! doom-snippets
  :after yasnippet)
; AndreaCrotti
(use-package! yasnippet-snippets
  :after yasnippet)
#+END_SRC
*** Kill over-eager literate after-save-hook
This is a little to frequent for working with a ~git~ repo. Henrik mentioned an
~async~ version of the recompliation might be in the works, until then however I
will probably only manually trigger the recompliation.
#+BEGIN_SRC emacs-lisp
(after! org
  (remove-hook 'after-save-hook #'+literate|recompile-maybe))
#+END_SRC
** Package Settings
These should eventually go into a different module.
Each of these.
*** Magit Aids
**** DONE Magit todos
Of course this is not really meant to be here..
A variation of this was included upstream in the ~develop~ branch.
#+BEGIN_SRC emacs-lisp :tangle no
(use-package! magit-org-todos
  :mode "\\COMMIT_EDITMSG\\'"
  :commands (magit-org-todods magit-org-todos-autoinsert)
  :config
  (magit-org-todos-autoinsert))
#+END_SRC
**** DONE Magithub
This is for sweet github integration.
Also integrated upstream.
#+BEGIN_SRC emacs-lisp :tangle no
(use-package! magithub
  :after magit
  :commands (magithub-clone
             magithub-completion-enable)
  ;; :ensure t
  :config
  (magithub-feature-autoinject t)
  (setq
   magithub-clone-default-directory "$HOME/Git/Github/"
   magithub-dir (concat doom-etc-dir "magithub/")
   magithub-preferred-remote-method 'clone_url))
(use-package! evil-magit :after magit
  :init
  (setq evil-magit-state 'normal))
#+END_SRC
**** Magit Annex
Barely any setup.
#+BEGIN_SRC emacs-lisp
(use-package! magit-annex
  :after magit)
(use-package! git-annex
  :after dired)
#+END_SRC
*** SaltStack Settings
I like having spell checks for everything.
#+BEGIN_SRC emacs-lisp
;; Load it
(use-package! salt-mode
  :config
;; Flyspell
(add-hook 'salt-mode-hook
        (lambda ()
            (flyspell-mode 1))))
#+END_SRC
# ** Hugo Stuff
# Easy hugo I don't need right now.
# #+BEGIN_SRC emacs-lisp
# (use-package! ox-hugo
#   :after ox)
# (use-package! ox-hugo-auto-export)
# #+END_SRC
