docs/config.html
<li><a id="orgf14dd2e"></a>Unicode Fonts<br />
<div class="outline-text-5" id="text-0-3-1-2">
<p>
This should be implemented as fallback font once <a href="https://github.com/hlissner/doom-emacs/pull/861">this</a> is merged.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">doom-unicode-font</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">font-spec</span> <span style="color: #c678dd;">:name</span> <span style="color: #98be65;">"DejaVu Sans Mono"</span> <span style="color: #c678dd;">:size</span> <span style="color: #da8548; font-weight: bold;">20</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

</pre>
</div>
</div>
</li>
<li><a id="orgaec03b2"></a>Helm and Childframes<br />
<div class="outline-text-5" id="text-0-3-1-3">
<p>
I prefer the regular diminished font size, even for the childframes.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Undo the helm text enlargement in childframes</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> +helm-posframe-text-scale <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org14dfbd3"></a>Saner Dashboard<br />
<div class="outline-text-5" id="text-0-3-1-4">
<p>
I have trouble at work with the current DOOM dashboard. This one is from the
<code>doom-emacs</code> lead developer, as found on Discord.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">+doom-dashboard-banner-file</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">expand-file-name</span> <span style="color: #98be65;">"banner.png"</span> <span style="color: #dcaeea;">doom-private-di</span><span style="color: #ffffff; background-color: brightblack;">r</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgb7c2d54" class="outline-4">
<h4 id="orgb7c2d54"><span class="section-number-4">0.3.2</span> Helm changes</h4>
<div class="outline-text-4" id="text-0-3-2">
<p>
This makes `helm` behave more like `ivy` while working with directories.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> helm
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">I want backspace to go up a level, like ivy</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">add-hook!</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">helm-find-files-after-init-hook</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:map</span> helm-find-files-map
          <span style="color: #98be65;">"&lt;DEL&gt;"</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">helm-find-files-up-one-level</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb5a3748" class="outline-4">
<h4 id="orgb5a3748"><span class="section-number-4">0.3.3</span> Kill spellcheck</h4>
<div class="outline-text-4" id="text-0-3-3">
<p>
This is really really really excruciatingly slow for LaTeX mode and maybe even
for other random buffers.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq-hook!</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">LaTeX-mode-hook</span> +spellcheck-immediately nil<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="orgab199be"></a>Snippets<br />
<div class="outline-text-5" id="text-0-3-3-1">
<p>
I am not sure if these need to be initialized.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">; </span><span style="color: #5B6268;">hlissner</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> doom-snippets
  <span style="color: #c678dd;">:after</span> yasnippet<span style="color: #51afef;">)</span>
<span style="color: #5B6268;">; </span><span style="color: #5B6268;">AndreaCrotti</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> yasnippet-snippets
  <span style="color: #c678dd;">:after</span> yasnippet<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org8aa4938" class="outline-4">
<h4 id="org8aa4938"><span class="section-number-4">0.3.4</span> Kill over-eager literate after-save-hook</h4>
<div class="outline-text-4" id="text-0-3-4">
<p>
This is a little to frequent for working with a <code>git</code> repo. Henrik mentioned an
<code>async</code> version of the recompliation might be in the works, until then however I
will probably only manually trigger the recompliation.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">remove-hook</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">after-save-hook</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">+literate|recompile-maybe</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5dfd2c8" class="outline-3">
<h3 id="org5dfd2c8"><span class="section-number-3">0.4</span> Package Settings</h3>
<div class="outline-text-3" id="text-0-4">
<p>
These should eventually go into a different module.
Each of these.
</p>
</div>
<div id="outline-container-org90b5f94" class="outline-4">
<h4 id="org90b5f94"><span class="section-number-4">0.4.1</span> Magit Aids</h4>
<div class="outline-text-4" id="text-0-4-1">
</div>
<ol class="org-ol">
<li><a id="org80a43b6"></a><span class="done DONE">DONE</span> Magit todos<br />
<div class="outline-text-5" id="text-0-4-1-1">
<p>
Of course this is not really meant to be here..
A variation of this was included upstream in the <code>develop</code> branch.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> magit-org-todos
  <span style="color: #c678dd;">:mode</span> <span style="color: #98be65;">"\\COMMIT_EDITMSG\\'"</span>
  <span style="color: #c678dd;">:commands</span> <span style="color: #c678dd;">(</span>magit-org-todods magit-org-todos-autoinsert<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">:config</span>
  <span style="color: #c678dd;">(</span>magit-org-todos-autoinsert<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> magit-todos<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org9e99c18"></a><span class="done DONE">DONE</span> Magithub<br />
<div class="outline-text-5" id="text-0-4-1-2">
<p>
This is for sweet github integration.
Also integrated upstream.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> magithub
  <span style="color: #c678dd;">:after</span> magit
  <span style="color: #c678dd;">:commands</span> <span style="color: #c678dd;">(</span>magithub-clone
             magithub-completion-enable<span style="color: #c678dd;">)</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">:ensure t</span>
  <span style="color: #c678dd;">:config</span>
  <span style="color: #c678dd;">(</span>magithub-feature-autoinject t<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span>
   magithub-clone-default-directory <span style="color: #98be65;">"$HOME/Git/Github/"</span>
   magithub-dir <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #dcaeea;">doom-etc-dir</span> <span style="color: #98be65;">"magithub/"</span><span style="color: #98be65;">)</span>
   magithub-preferred-remote-method <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">clone_url</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> evil-magit <span style="color: #c678dd;">:after</span> magit
  <span style="color: #c678dd;">:init</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">evil-magit-state</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">normal</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org9a16ec4"></a>Magit Annex<br />
<div class="outline-text-5" id="text-0-4-1-3">
<p>
Barely any setup.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> magit-annex
  <span style="color: #c678dd;">:after</span> magit<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> git-annex
  <span style="color: #c678dd;">:after</span> dired<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgb90e9da" class="outline-4">
<h4 id="orgb90e9da"><span class="section-number-4">0.4.2</span> SaltStack Settings</h4>
<div class="outline-text-4" id="text-0-4-2">
<p>
I like having spell checks for everything.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Load it</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> salt-mode
  <span style="color: #c678dd;">:config</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Flyspell</span>
<span style="color: #c678dd;">(</span><span style="color: #c678dd;">add-hook</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">salt-mode-hook</span>
        <span style="color: #98be65;">(</span><span style="color: #51afef;">lambda</span> <span style="color: #51afef;">()</span>
            <span style="color: #51afef;">(</span><span style="color: #dcaeea;">flyspell-mode</span> <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
