config.org
** Anki Editor
# TODO Add to doom as a module
This is for my favorite [[https://github.com/louietan/anki-editor][anki interaction]] mechanism.
#+BEGIN_SRC emacs-lisp
(use-package! anki-editor
  :after org-noter
  :config
  ; I like making decks
  (setq anki-editor-create-decks 't))
#+END_SRC
** Keybindings
These are eventually going to with [[https://github.com/noctuid/general.el][general]] anyway. So it's better to load that
for now and carry on. Later this block can be prevented from being tangled.
*** DONE General
- [X] Remove once merged upstream.
This does very little other than load it and remind it that ~SPC~ is the leader for the other bindings to work.
#+BEGIN_SRC emacs-lisp :tangle no
(use-package! general)
;; Creating a constant for making future changes simpler
(defconst my-leader "SPC")
;; Tell general all about it
(general-create-definer my-leader-def
  :prefix my-leader)
  ;; :prefix my-leader)
;; (general-create-definer my-local-leader-def
;;   ;; :prefix my-local-leader
;;   :prefix "SPC m")
#+END_SRC
*** Evil Setup and Error Handling
Actually this might not be ported over so I'm just going to put this elsewhere.
#+BEGIN_SRC emacs-lisp
;; I like short names
(general-evil-setup t)
;; Stop telling me things begin with non-prefix keys
(general-auto-unbind-keys)
#+END_SRC
*** Spacemacs Equivalency
**** Escape
I find the default ~jk~ evil escape key sequence to be distracting as I am
unable to navigate with one hand on the mouse anymore.
#+BEGIN_SRC emacs-lisp
(setq-default evil-escape-key-sequence "fd")
#+END_SRC
**** Kill buffer
Also it's inconvinient to have a key chord requiring two hands to close a
buffer.
#+BEGIN_SRC emacs-lisp
; Compatibility, delete when fully migrated
(defconst my-leader "SPC")
; Bind a new key chord
(map!
 (:leader
   (:prefix "b"
     :desc "Kill buffer" "d" #'kill-this-buffer)
   (:prefix ("k" . "kill")
     :desc "Save and kill" "e" 'save-buffers-kill-terminal
     :desc "Kill buffer" "b" 'my-kill-this-buffer
     :desc "Delete frame" "f" 'delete-frame
   (:prefix ("o" . "Other")
     :desc "Frames" "f" 'delete-other-frames
     :desc "Windows" "w" 'delete-other-windows
     )
   )
   ))
#+END_SRC
***** general.el
The binding syntax of the future, TODAY!
#+BEGIN_SRC emacs-lisp :tangle no
;; ** Global Keybindings
;; Normal mode?
(nmap
 :prefix my-leader
 "b d" #'kill-this-buffer
  ;; kill things
  "k" '(:ignore t :which-key "kill")
  "k e" 'save-buffers-kill-terminal
  "k b" 'my-kill-this-buffer
  "k f" 'delete-frame
  "k o f" 'delete-other-frames
  "k o w" 'delete-other-windows
 "a" 'helm-mini)
;; (my-leader-def 'normal 'override
;;   "a" 'org-agenda)
#+END_SRC
*** Global Maps
**** Multiple Cursors
These need practice. Many of these are already in the default configuration, but
they are redefined here for mnemonic usage. Also to add the ~which-key~ hints.
#+BEGIN_SRC emacs-lisp
(nmap
  :prefix "gz"
  :keymaps 'global
  "r" '(mc/edit-lines :wk "Span region")
  "z" '(+evil/mc-make-cursor-here :wk "Place frozen cursor")
  )
#+END_SRC
