docs/config.html
<div id="outline-container-org91fbb5c" class="outline-3">
<h3 id="org91fbb5c"><span class="section-number-3">0.5</span> Anki Editor</h3>
<div class="outline-text-3" id="text-0-5">
<p>
This is for my favorite <a href="https://github.com/louietan/anki-editor">anki interaction</a> mechanism.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> anki-editor
  <span style="color: #c678dd;">:after</span> org-noter
  <span style="color: #c678dd;">:config</span>
  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">I like making decks</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">anki-editor-create-decks</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">t</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org98611ef" class="outline-3">
<h3 id="org98611ef"><span class="section-number-3">0.6</span> Keybindings</h3>
<div class="outline-text-3" id="text-0-6">
<p>
These are eventually going to with <a href="https://github.com/noctuid/general.el">general</a> anyway. So it&rsquo;s better to load that
for now and carry on. Later this block can be prevented from being tangled.
</p>
</div>
<div id="outline-container-orgbb80efe" class="outline-4">
<h4 id="orgbb80efe"><span class="section-number-4">0.6.1</span> <span class="done DONE">DONE</span> General</h4>
<div class="outline-text-4" id="text-0-6-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Remove once merged upstream.</li>
</ul>
<p>
This does very little other than load it and remind it that <code>SPC</code> is the leader for the other bindings to work.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> general<span style="color: #51afef;">)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Creating a constant for making future changes simpler</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">defconst</span> <span style="color: #dcaeea;">my-leader</span> <span style="color: #98be65;">"SPC"</span><span style="color: #51afef;">)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Tell general all about it</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">general-create-definer</span> my-leader-def
  <span style="color: #c678dd;">:prefix</span> <span style="color: #dcaeea;">my-leader</span><span style="color: #51afef;">)</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">:prefix my-leader)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(general-create-definer my-local-leader-def</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">;; :prefix my-local-leader</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">:prefix "SPC m")</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org23bfc3e" class="outline-4">
<h4 id="org23bfc3e"><span class="section-number-4">0.6.2</span> Evil Setup and Error Handling</h4>
<div class="outline-text-4" id="text-0-6-2">
<p>
Actually this might not be ported over so I&rsquo;m just going to put this elsewhere.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">I like short names</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">general-evil-setup</span> t<span style="color: #51afef;">)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Stop telling me things begin with non-prefix keys</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">general-auto-unbind-keys</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaf66284" class="outline-4">
<h4 id="orgaf66284"><span class="section-number-4">0.6.3</span> Spacemacs Equivalency</h4>
<div class="outline-text-4" id="text-0-6-3">
</div>
<ol class="org-ol">
<li><a id="org78ba69f"></a>Escape<br />
<div class="outline-text-5" id="text-0-6-3-1">
<p>
I find the default <code>jk</code> evil escape key sequence to be distracting as I am
unable to navigate with one hand on the mouse anymore.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq-default</span> <span style="color: #dcaeea;">evil-escape-key-sequence</span> <span style="color: #98be65;">"fd"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org2cba3d1"></a>Kill buffer<br />
<div class="outline-text-5" id="text-0-6-3-2">
<p>
Also it&rsquo;s inconvinient to have a key chord requiring two hands to close a
buffer.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">; </span><span style="color: #5B6268;">Compatibility, delete when fully migrated</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">defconst</span> <span style="color: #dcaeea;">my-leader</span> <span style="color: #98be65;">"SPC"</span><span style="color: #51afef;">)</span>
<span style="color: #5B6268;">; </span><span style="color: #5B6268;">Bind a new key chord</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span>
 <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:leader</span>
   <span style="color: #98be65;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">"b"</span>
     <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Kill buffer"</span> <span style="color: #98be65;">"d"</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">kill-this-buffer</span><span style="color: #98be65;">)</span>
   <span style="color: #98be65;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #51afef;">(</span><span style="color: #98be65;">"k"</span> . <span style="color: #98be65;">"kill"</span><span style="color: #51afef;">)</span>
     <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Save and kill"</span> <span style="color: #98be65;">"e"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">save-buffers-kill-terminal</span>
     <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Kill buffer"</span> <span style="color: #98be65;">"b"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">my-kill-this-buffer</span>
     <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Delete frame"</span> <span style="color: #98be65;">"f"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">delete-frame</span>
   <span style="color: #51afef;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">"o"</span> . <span style="color: #98be65;">"Other"</span><span style="color: #c678dd;">)</span>
     <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Frames"</span> <span style="color: #98be65;">"f"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">delete-other-frames</span>
     <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Windows"</span> <span style="color: #98be65;">"w"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">delete-other-windows</span>
     <span style="color: #51afef;">)</span>
   <span style="color: #98be65;">)</span>
   <span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="orgc268ee8"></a>general.el<br />
<div class="outline-text-6" id="text-0-6-3-2-1">
<p>
The binding syntax of the future, TODAY!
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">** Global Keybindings</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Normal mode?</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">nmap</span>
 <span style="color: #c678dd;">:prefix</span> <span style="color: #dcaeea;">my-leader</span>
 <span style="color: #98be65;">"b d"</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">kill-this-buffer</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">kill things</span>
  <span style="color: #98be65;">"k"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:which-key</span> <span style="color: #98be65;">"kill"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"k e"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">save-buffers-kill-terminal</span>
  <span style="color: #98be65;">"k b"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">my-kill-this-buffer</span>
  <span style="color: #98be65;">"k f"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">delete-frame</span>
  <span style="color: #98be65;">"k o f"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">delete-other-frames</span>
  <span style="color: #98be65;">"k o w"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">delete-other-windows</span>
 <span style="color: #98be65;">"a"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">helm-mini</span><span style="color: #51afef;">)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(my-leader-def 'normal 'override</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">"a" 'org-agenda)</span>
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgc5e38b9" class="outline-4">
<h4 id="orgc5e38b9"><span class="section-number-4">0.6.4</span> Global Maps</h4>
<div class="outline-text-4" id="text-0-6-4">
</div>
<ol class="org-ol">
<li><a id="orgf1ef206"></a>Multiple Cursors<br />
<div class="outline-text-5" id="text-0-6-4-1">
<p>
These need practice. Many of these are already in the default configuration, but
they are redefined here for mnemonic usage. Also to add the <code>which-key</code> hints.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">nmap</span>
  <span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">"gz"</span>
  <span style="color: #c678dd;">:keymaps</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">global</span>
  <span style="color: #98be65;">"r"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>mc/edit-lines <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Span region"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"z"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>+evil/mc-make-cursor-here <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Place frozen cursor"</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
