config.org
**** Replace Stuff
There are way too many of these to keep using ~helm~.
#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("r" . "Replace")
      :desc "String" "s" 'replace-string
      :desc "Query" "q" 'query-replace
      (:prefix ("r" . "Regexp")
        :desc "String" "s" 'replace-regexp
        :desc "Query" "q" 'query-replace-regexp
        )
      )
      )
#+END_SRC
**** Insert Unicode
This should hopefully propogate across all modes.
#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("i" . "Insert")
       :desc "Unicode" "u" 'insert-char
       :desc "Snippet" "s" 'yas-insert-snippet
       :desc "From Clipboard" "y" '+default/yank-pop
       :desc "From Evil Registers" "r" 'counsel-evil-registers
      )
)
#+END_SRC
**** Lookup
These were bound to really weird things.
#+BEGIN_SRC emacs-lisp
(nmap
  :prefix my-leader
  ;; look things up
  "l" '(:ignore t :wk "lookup")
  "l o" '(+lookup/online-select :wk "Online")
  "l f" '(+lookup/file :wk "File")
  )
#+END_SRC
**** No ESC
The escape key for exiting things seems very painful.
#+BEGIN_SRC emacs-lisp
(general-define-key
 :keymaps '(insert visual normal)
 "S-SPC" 'evil-force-normal-state)
 #+END_SRC
*** Markdown Improvements
Local leader is already bound to `m` and there are few bindings, this just adds
more.
#+BEGIN_SRC emacs-lisp
(map! :localleader
      :map markdown-mode-map
      :prefix ("i" . "Insert")
      :desc "Image"   "i" 'markdown-insert-image
      :desc "Link"    "l" 'markdown-insert-link
      :desc "Github Code Block" "c" 'markdown-insert-gfm-code-block
      (:prefix ("h" . "Headings")
        :desc "One"   "1" 'markdown-insert-atx-1
        :desc "Two"   "2" 'markdown-insert-atx-2
        :desc "Three" "3" 'markdown-insert-atx-3
        :desc "Four"  "4" 'markdown-insert-atx-4
        :desc "Five"  "5" 'markdown-insert-atx-5
        :desc "Six"   "6" 'markdown-insert-atx-6))
#+END_SRC
*** Org Noter
These bindings should probably be after ~org-noter~ is loaded.
#+BEGIN_SRC emacs-lisp
(map! :localleader
      :map (org-mode-map pdf-view-mode-map)
      (:prefix ("o" . "Org")
        (:prefix ("n" . "Noter")
          :desc "Noter" "n" 'org-noter
          )))
#+END_SRC
*** Pdf Mode
These bindings are essentially part of ~org-noter~ however, they do not actually
need to be bound in ~org-mode~ files.
#+BEGIN_SRC emacs-lisp
; localleader is SPC m
(map! :localleader
      :map pdf-view-mode-map
      (:prefix "o"
        (:prefix "n"
          :desc "Insert" "i" 'org-noter-insert-note
          )))
#+END_SRC
