docs/config.html
<li><a id="org481d047"></a>Replace Stuff<br />
<div class="outline-text-5" id="text-0-6-4-2">
<p>
There are way too many of these to keep using <code>helm</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:leader</span>
      <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"r"</span> . <span style="color: #98be65;">"Replace"</span><span style="color: #98be65;">)</span>
      <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"String"</span> <span style="color: #98be65;">"s"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">replace-string</span>
      <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Query"</span> <span style="color: #98be65;">"q"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">query-replace</span>
      <span style="color: #98be65;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #51afef;">(</span><span style="color: #98be65;">"r"</span> . <span style="color: #98be65;">"Regexp"</span><span style="color: #51afef;">)</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"String"</span> <span style="color: #98be65;">"s"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">replace-regexp</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Query"</span> <span style="color: #98be65;">"q"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">query-replace-regexp</span>
        <span style="color: #98be65;">)</span>
      <span style="color: #c678dd;">)</span>
      <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgd61f7dc"></a>Insert Unicode<br />
<div class="outline-text-5" id="text-0-6-4-3">
<p>
This should hopefully propogate across all modes.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:leader</span>
      <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"i"</span> . <span style="color: #98be65;">"Insert"</span><span style="color: #98be65;">)</span>
       <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Unicode"</span> <span style="color: #98be65;">"u"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">insert-char</span>
       <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Snippet"</span> <span style="color: #98be65;">"s"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">yas-insert-snippet</span>
       <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"From Clipboard"</span> <span style="color: #98be65;">"y"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">+default/yank-pop</span>
       <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"From Evil Registers"</span> <span style="color: #98be65;">"r"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">counsel-evil-registers</span>
      <span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgb0b3d12"></a>Lookup<br />
<div class="outline-text-5" id="text-0-6-4-4">
<p>
These were bound to really weird things.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">nmap</span>
  <span style="color: #c678dd;">:prefix</span> <span style="color: #dcaeea;">my-leader</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">look things up</span>
  <span style="color: #98be65;">"l"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"lookup"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"l o"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>+lookup/online-select <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Online"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"l f"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>+lookup/file <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"File"</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org2d86b9e"></a>No ESC<br />
<div class="outline-text-5" id="text-0-6-4-5">
<p>
The escape key for exiting things seems very painful.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">general-define-key</span>
 <span style="color: #c678dd;">:keymaps</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>insert visual normal<span style="color: #c678dd;">)</span>
 <span style="color: #98be65;">"S-SPC"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">evil-force-normal-state</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org3a2329a" class="outline-4">
<h4 id="org3a2329a"><span class="section-number-4">0.6.5</span> Markdown Improvements</h4>
<div class="outline-text-4" id="text-0-6-5">
<p>
Local leader is already bound to `m` and there are few bindings, this just adds
more.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:localleader</span>
      <span style="color: #c678dd;">:map</span> <span style="color: #dcaeea;">markdown-mode-map</span>
      <span style="color: #c678dd;">:prefix</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">"i"</span> . <span style="color: #98be65;">"Insert"</span><span style="color: #c678dd;">)</span>
      <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Image"</span>   <span style="color: #98be65;">"i"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">markdown-insert-image</span>
      <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Link"</span>    <span style="color: #98be65;">"l"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">markdown-insert-link</span>
      <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Github Code Block"</span> <span style="color: #98be65;">"c"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">markdown-insert-gfm-code-block</span>
      <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"h"</span> . <span style="color: #98be65;">"Headings"</span><span style="color: #98be65;">)</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"One"</span>   <span style="color: #98be65;">"1"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">markdown-insert-atx-1</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Two"</span>   <span style="color: #98be65;">"2"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">markdown-insert-atx-2</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Three"</span> <span style="color: #98be65;">"3"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">markdown-insert-atx-3</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Four"</span>  <span style="color: #98be65;">"4"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">markdown-insert-atx-4</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Five"</span>  <span style="color: #98be65;">"5"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">markdown-insert-atx-5</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Six"</span>   <span style="color: #98be65;">"6"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">markdown-insert-atx-6</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org41bc970" class="outline-4">
<h4 id="org41bc970"><span class="section-number-4">0.6.6</span> Org Noter</h4>
<div class="outline-text-4" id="text-0-6-6">
<p>
These bindings should probably be after <code>org-noter</code> is loaded.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:localleader</span>
      <span style="color: #c678dd;">:map</span> <span style="color: #c678dd;">(</span><span style="color: #dcaeea;">org-mode-map</span> pdf-view-mode-map<span style="color: #c678dd;">)</span>
      <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"o"</span> . <span style="color: #98be65;">"Org"</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #51afef;">(</span><span style="color: #98be65;">"n"</span> . <span style="color: #98be65;">"Noter"</span><span style="color: #51afef;">)</span>
          <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Noter"</span> <span style="color: #98be65;">"n"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-noter</span>
          <span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb5632bd" class="outline-4">
<h4 id="orgb5632bd"><span class="section-number-4">0.6.7</span> Pdf Mode</h4>
<div class="outline-text-4" id="text-0-6-7">
<p>
These bindings are essentially part of <code>org-noter</code> however, they do not actually
need to be bound in <code>org-mode</code> files.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">; </span><span style="color: #5B6268;">localleader is SPC m</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:localleader</span>
      <span style="color: #c678dd;">:map</span> pdf-view-mode-map
      <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">"o"</span>
        <span style="color: #98be65;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">"n"</span>
          <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Insert"</span> <span style="color: #98be65;">"i"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-noter-insert-note</span>
          <span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
