docs/config.html
<div id="outline-container-org722197a" class="outline-4">
<h4 id="org722197a"><span class="section-number-4">0.6.8</span> Org Mode additions</h4>
<div class="outline-text-4" id="text-0-6-8">
<p>
Apart from extension specific bindings, here we define useful functions which
are a part of <code>org-mode</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:localleader</span>
      <span style="color: #c678dd;">:map</span> <span style="color: #dcaeea;">org-mode-map</span>
      <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">"o"</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Tags"</span> <span style="color: #98be65;">"t"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-set-tags</span>
        <span style="color: #98be65;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #51afef;">(</span><span style="color: #98be65;">"p"</span> . <span style="color: #98be65;">"Properties"</span><span style="color: #51afef;">)</span>
          <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Set"</span> <span style="color: #98be65;">"s"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-set-property</span>
          <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Delete"</span> <span style="color: #98be65;">"d"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-delete-property</span>
          <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Actions"</span> <span style="color: #98be65;">"a"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-property-action</span>
          <span style="color: #98be65;">)</span>
        <span style="color: #c678dd;">)</span>
      <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"i"</span> . <span style="color: #98be65;">"Insert"</span><span style="color: #98be65;">)</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Link/Image"</span> <span style="color: #98be65;">"l"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-insert-link</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Item"</span> <span style="color: #98be65;">"o"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-insert-item</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Footnote"</span> <span style="color: #98be65;">"f"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-footnote-action</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Table"</span> <span style="color: #98be65;">"t"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-table-create-or-convert-from-region</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Screenshot"</span> <span style="color: #98be65;">"s"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-screenshot-take</span>
        <span style="color: #98be65;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #51afef;">(</span><span style="color: #98be65;">"h"</span> . <span style="color: #98be65;">"Headings"</span><span style="color: #51afef;">)</span>
          <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Normal"</span> <span style="color: #98be65;">"h"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-insert-heading</span>
          <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Todo"</span> <span style="color: #98be65;">"t"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-insert-todo-heading</span>
          <span style="color: #51afef;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">"s"</span> . <span style="color: #98be65;">"Subheadings"</span><span style="color: #c678dd;">)</span>
            <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Normal"</span> <span style="color: #98be65;">"s"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-insert-subheading</span>
            <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Todo"</span> <span style="color: #98be65;">"t"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-insert-todo-subheading</span>
            <span style="color: #51afef;">)</span>
          <span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #51afef;">(</span><span style="color: #98be65;">"e"</span> . <span style="color: #98be65;">"Exports"</span><span style="color: #51afef;">)</span>
          <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Dispatch"</span> <span style="color: #98be65;">"d"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-export-dispatch</span>
          <span style="color: #98be65;">)</span>
        <span style="color: #c678dd;">)</span>
      <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org427097d" class="outline-4">
<h4 id="org427097d"><span class="section-number-4">0.6.9</span> Anki Editor</h4>
<div class="outline-text-4" id="text-0-6-9">
<p>
These are only relevant to <code>org-mode</code>. Nevertheless they are not part of
<code>org-mode</code> so semantically it makes no sense to use <code>o</code> after the localleader.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:localleader</span>
      <span style="color: #c678dd;">:map</span> <span style="color: #dcaeea;">org-mode-map</span>
      <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"a"</span> . <span style="color: #98be65;">"Anki"</span><span style="color: #98be65;">)</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Push"</span> <span style="color: #98be65;">"p"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">anki-editor-push-notes</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Retry"</span> <span style="color: #98be65;">"r"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">anki-editor-retry-failure-notes</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Insert"</span> <span style="color: #98be65;">"n"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">anki-editor-insert-note</span>
        <span style="color: #98be65;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #51afef;">(</span><span style="color: #98be65;">"c"</span> . <span style="color: #98be65;">"Cloze"</span><span style="color: #51afef;">)</span>
          <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Dwim"</span> <span style="color: #98be65;">"d"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">anki-editor-cloze-dwim</span>
          <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Region"</span> <span style="color: #98be65;">"r"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">anki-editor-cloze-region</span>
          <span style="color: #98be65;">)</span>
        <span style="color: #c678dd;">)</span>
 <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd755ca1" class="outline-4">
<h4 id="orgd755ca1"><span class="section-number-4">0.6.10</span> CC Mode</h4>
<div class="outline-text-4" id="text-0-6-10">
<p>
These are basically wrappers around various <code>rtags</code> functions.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">nmap</span>
<span style="color: #c678dd;">:prefix</span> <span style="color: #dcaeea;">my-leader</span>
<span style="color: #c678dd;">:keymaps</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">c-mode-base-map</span>
<span style="color: #98be65;">"m"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Local Commands"</span><span style="color: #c678dd;">)</span>
<span style="color: #98be65;">"m r"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Rtags"</span><span style="color: #c678dd;">)</span>
<span style="color: #98be65;">"m r c"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>rtags-check-includes <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Check Includes"</span><span style="color: #c678dd;">)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">All the find commands</span>
<span style="color: #98be65;">"m r f"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Find"</span><span style="color: #c678dd;">)</span>
<span style="color: #98be65;">"m r f s"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Symbol"</span><span style="color: #c678dd;">)</span>
<span style="color: #98be65;">"m r f s a"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>rtags-find-symbol-at-point <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"At point"</span><span style="color: #c678dd;">)</span>
<span style="color: #98be65;">"m r f s s"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>rtags-find-symbol <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Symbol"</span><span style="color: #c678dd;">)</span>
<span style="color: #98be65;">"m r f s c"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Current"</span><span style="color: #c678dd;">)</span>
<span style="color: #98be65;">"m r f s c f"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>rtags-find-symbol-current-file <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"File"</span><span style="color: #c678dd;">)</span>
<span style="color: #98be65;">"m r f s c d"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>rtags-find-symbol-current-dir <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Directory"</span><span style="color: #c678dd;">)</span>
<span style="color: #98be65;">"m r f f"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>rtags-find-functions-called-by-this-function <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Functions"</span><span style="color: #c678dd;">)</span>
<span style="color: #98be65;">"m r f r"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>rtags-find-references <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"References"</span><span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span>

</pre>
</div>
</div>
</div>
