config.org
*** Evil Movement
These are mostly for convinience. I know that the upper cased versions of
commands are usually for the reverse action, but unless I get a 60% keyboard
these seem comfortable.
#+BEGIN_SRC emacs-lisp
(nmap 
  "K" 'nil
  "K" 'evil-scroll-page-up
  "J" 'evil-scroll-page-down)
#+END_SRC
*** DONE Neotree --> Treemacs
**** CANCELLED Toggle pane
This remaps ~SPC o N~ to use ~treemacs~.
I guess this doesn't make all that much sense, but ~t~ and ~T~ and bound to
terminals and that makes sense, so I guess this is fine.
#+BEGIN_SRC emacs-lisp :tangle no
;; Remap opening the sidebar
(map! :leader
      :nv "o n" nil
      :desc "Open treemacs pane"
      :n "o n" #'+treemacs/toggle)
;; Remap finding stuff
(map! :leader
      :nv "o N" nil
      :desc "Treemacs find file"
      :n "o N" 'treemacs-find-file)
#+END_SRC
Cancelled since [[https://github.com/hlissner/doom-emacs/commit/287460cb050c94010f4d8ded0fbfecf479c1772a][this commit]] on the ~develop~ branch.
*** TeX Mode
These are more semantic for me.
#+BEGIN_SRC emacs-lisp
(nmap
  :prefix my-leader
  :keymaps '(latex-mode-map tex-mode-map LaTeX-mode-map)
  ;; Folding Stuff
  "m f" '(:ignore t :wk "Fold Things")
  "m f c" '(TeX-fold-comment :wk "Comment")
  "m f e" '(TeX-fold-env :wk "Environment")
  "m f m" '(TeX-fold-math :wk "Math")
  ;; Insertions
  "m i" '(:ignore t :wk "Insert")
  "m i m" '(helm-insert-latex-math :wk "Math Symbols")
  "m i r" '(:ignore t :wk "References")
  "m i r h" '(helm-bibtex-with-local-bibliography :wk "Helm")
  "m i r r" '(reftex-citation :wk "Reftex")
  )
#+END_SRC
** Org Additions
These are numerous and complicated enough to be in a segment of their own.
*** File Handling
This controls what is used to open links in ~org~ documents. Since there are
only a few defaults defined, I am just prepending them to my changes instead of
dealing with ~append~ and stuff.
#+BEGIN_SRC emacs-lisp
(setq org-file-apps
  '((auto-mode . emacs)
    ("\\.mm\\'" . default)
    ("\\.x?html?\\'" . default)
    ("\\.pdf\\'" . default)
    ("\\.png\\'" . viewnior)
    ("\\.jpg\\'" . viewnior)
    ))
#+END_SRC
*** Ob-Julia
So ~julia~ support is inbuilt, however the process variable needs to be set:
#+BEGIN_SRC emacs-lisp
(setq  inferior-julia-program-name "/bin/julia")
#+END_SRC
*** Org Babel
Julia is not set. Other languages might also be needed here eventually.
#+BEGIN_SRC emacs-lisp
(after! 'org
            (org-babel-do-load-languages 'org-babel-load-languages
                                         (append org-babel-load-languages
                                                 '(julia . t))))
#+END_SRC
*** Org Config
These are just variables I need to set to prevent things from dying.
**** Inline images
These need to be disabled by default otherwise ~emacs~ stalls often.
#+BEGIN_SRC emacs-lisp
(setq org-startup-with-inline-images 'nil)
#+END_SRC
