docs/config.html
<div id="outline-container-org357ed44" class="outline-4">
<h4 id="org357ed44"><span class="section-number-4">0.6.11</span> Evil Movement</h4>
<div class="outline-text-4" id="text-0-6-11">
<p>
These are mostly for convinience. I know that the upper cased versions of
commands are usually for the reverse action, but unless I get a 60% keyboard
these seem comfortable.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">nmap</span> 
  <span style="color: #98be65;">"K"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">nil</span>
  <span style="color: #98be65;">"K"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">evil-scroll-page-up</span>
  <span style="color: #98be65;">"J"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">evil-scroll-page-down</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org48f2af6" class="outline-4">
<h4 id="org48f2af6"><span class="section-number-4">0.6.12</span> <span class="done DONE">DONE</span> Neotree &#x2013;&gt; Treemacs</h4>
<div class="outline-text-4" id="text-0-6-12">
</div>
<ol class="org-ol">
<li><a id="org230a959"></a>CANCELLED Toggle pane<br />
<div class="outline-text-5" id="text-0-6-12-1">
<p>
This remaps <code>SPC o N</code> to use <code>treemacs</code>.
I guess this doesn&rsquo;t make all that much sense, but <code>t</code> and <code>T</code> and bound to
terminals and that makes sense, so I guess this is fine.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Remap opening the sidebar</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:leader</span>
      <span style="color: #c678dd;">:nv</span> <span style="color: #98be65;">"o n"</span> nil
      <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Open treemacs pane"</span>
      <span style="color: #c678dd;">:n</span> <span style="color: #98be65;">"o n"</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">+treemacs/toggle</span><span style="color: #51afef;">)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Remap finding stuff</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:leader</span>
      <span style="color: #c678dd;">:nv</span> <span style="color: #98be65;">"o N"</span> nil
      <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Treemacs find file"</span>
      <span style="color: #c678dd;">:n</span> <span style="color: #98be65;">"o N"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">treemacs-find-file</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
Cancelled since <a href="https://github.com/hlissner/doom-emacs/commit/287460cb050c94010f4d8ded0fbfecf479c1772a">this commit</a> on the <code>develop</code> branch.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org9739d63" class="outline-4">
<h4 id="org9739d63"><span class="section-number-4">0.6.13</span> TeX Mode</h4>
<div class="outline-text-4" id="text-0-6-13">
<p>
These are more semantic for me.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">nmap</span>
  <span style="color: #c678dd;">:prefix</span> <span style="color: #dcaeea;">my-leader</span>
  <span style="color: #c678dd;">:keymaps</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>latex-mode-map tex-mode-map LaTeX-mode-map<span style="color: #c678dd;">)</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Folding Stuff</span>
  <span style="color: #98be65;">"m f"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Fold Things"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"m f c"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>TeX-fold-comment <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Comment"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"m f e"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>TeX-fold-env <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Environment"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"m f m"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>TeX-fold-math <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Math"</span><span style="color: #c678dd;">)</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Insertions</span>
  <span style="color: #98be65;">"m i"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Insert"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"m i m"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>helm-insert-latex-math <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Math Symbols"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"m i r"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"References"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"m i r h"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>helm-bibtex-with-local-bibliography <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Helm"</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"m i r r"</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>reftex-citation <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Reftex"</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org226f08e" class="outline-3">
<h3 id="org226f08e"><span class="section-number-3">0.7</span> Org Additions</h3>
<div class="outline-text-3" id="text-0-7">
<p>
These are numerous and complicated enough to be in a segment of their own.
</p>
</div>
<div id="outline-container-org493c31f" class="outline-4">
<h4 id="org493c31f"><span class="section-number-4">0.7.1</span> File Handling</h4>
<div class="outline-text-4" id="text-0-7-1">
<p>
This controls what is used to open links in <code>org</code> documents. Since there are
only a few defaults defined, I am just prepending them to my changes instead of
dealing with <code>append</code> and stuff.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-file-apps</span>
  <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>auto-mode . emacs<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #98be65;">"\\.mm\\'"</span> . default<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #98be65;">"\\.x?html?\\'"</span> . default<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #98be65;">"\\.pdf\\'"</span> . default<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #98be65;">"\\.png\\'"</span> . viewnior<span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #98be65;">"\\.jpg\\'"</span> . viewnior<span style="color: #98be65;">)</span>
    <span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org87a2cd8" class="outline-4">
<h4 id="org87a2cd8"><span class="section-number-4">0.7.2</span> Ob-Julia</h4>
<div class="outline-text-4" id="text-0-7-2">
<p>
So <code>julia</code> support is inbuilt, however the process variable needs to be set:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span>  inferior-julia-program-name <span style="color: #98be65;">"/bin/julia"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge755a4b" class="outline-4">
<h4 id="orge755a4b"><span class="section-number-4">0.7.3</span> Org Babel</h4>
<div class="outline-text-4" id="text-0-7-3">
<p>
Julia is not set. Other languages might also be needed here eventually.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org</span>
            <span style="color: #c678dd;">(</span><span style="color: #c678dd;">org-babel-do-load-languages</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-babel-load-languages</span>
                                         <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">append</span> <span style="color: #dcaeea;">org-babel-load-languages</span>
                                                 <span style="color: #51afef;">'</span><span style="color: #51afef;">(</span>julia . t<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6a306c8" class="outline-4">
<h4 id="org6a306c8"><span class="section-number-4">0.7.4</span> Org Config</h4>
<div class="outline-text-4" id="text-0-7-4">
<p>
These are just variables I need to set to prevent things from dying.
</p>
</div>
<ol class="org-ol">
<li><a id="orgee2fea0"></a>Inline images<br />
<div class="outline-text-5" id="text-0-7-4-1">
<p>
These need to be disabled by default otherwise <code>emacs</code> stalls often.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-startup-with-inline-images</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">nil</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
