config.org
*** Org Rifle
This probably needs to be refactored later. Or loaded elsewhere.
The keymaps are defined in the following way:
#+BEGIN_SRC emacs-lisp
(use-package! helm-org-rifle
  :after org
  :general
  (:keymaps 'org-mode-map
            :states 'normal
            :prefix my-leader
            "m r" '(:ignore t :wk "Rifle (Helm)")
            "m r b" '(helm-org-rifle-current-buffer :wk "Rifle buffer")
            "m r e" '(helm-org-rifle :wk "Rifle every open buffer")
            "m r d" '(helm-org-rifle-directory :wk "Rifle from org-directory")
            "m r a" '(helm-org-rifle-agenda-files :wk "Rifle agenda")
            "m r o" '(:ignore t :wk "Occur (Persistent)")
            "m r o b" '(helm-org-rifle-current-buffer :wk "Rifle buffer")
            "m r o e" '(helm-org-rifle :wk "Rifle every open buffer")
            "m r o d" '(helm-org-rifle-directory :wk "Rifle from org-directory")
            "m r o a" '(helm-org-rifle-agenda-files :wk "Rifle agenda")
            )
  )
#+END_SRC
*** Org Mind Map
[[https://github.com//theodorewiles/org-mind-map][This]] is used to create ~graphiz~ graphs from ~org-mode~ stuff.
#+BEGIN_SRC emacs-lisp
(use-package! org-mind-map
  :general
  (:keymaps 'org-mode-map
            :states 'normal
            :prefix my-leader
            "m e m" '(org-mind-map-write :wk "Export mind-map") ))
#+END_SRC
*** Org Download
This is already included in the standard doom setup. However, I was having
trouble with relative exports so I have this one instead. Partially kanged from
~doom-emacs~.
#+BEGIN_SRC emacs-lisp
(use-package! org-download
  :after org
  :config
(setq-default org-download-image-dir "./img/"
              org-download-screenshot-method "scrot -s %s"
              org-download-method 'directory
              org-download-heading-lvl 1
              )
  )
#+END_SRC
*** Org Drill
This is much easier to work with compared to the Anki mode stuff.
#+BEGIN_SRC emacs-lisp :tangle no
(use-package! org-drill
  :after org)
#+END_SRC
** Syntax Highlighting
This section is for setting up major modes for various file formats which are
typically non-standard. These are matched by extensions.
*** TODO Direnv Highlighting
~direnv~ is essentially a specialized bash script. Until I have time to make a
proper font locking mode for it, this should suffice.
#+BEGIN_SRC emacs-lisp
(setq auto-mode-alist (append '(("\\.envrc$" . shell-script-mode))
                              auto-mode-alist))
#+END_SRC
*** PKGBUILD Mode
This is the non ~doom~ way of loading this.
#+BEGIN_SRC emacs-lisp :tangle no
(autoload 'pkgbuild-mode "pkgbuild-mode.el" "PKGBUILD mode." t)
(setq auto-mode-alist (append '(("/PKGBUILD$" . pkgbuild-mode))
                              auto-mode-alist))
#+END_SRC
I use ~doom~. So.
#+BEGIN_SRC emacs-lisp
(use-package! pkgbuild-mode
  :mode "\\PKGBUILD")
#+END_SRC
*** LAMMPS Mode
**** No doom setup
For most users.
#+BEGIN_SRC emacs-lisp :tangle no
(autoload 'lammps-mode "lammps-mode.el" "LAMMPS mode." t)
(setq auto-mode-alist (append
                              '(("in\\.'" . lammps-mode))
                              '(("\\.lmp\\'" . lammps-mode))
                              auto-mode-alist
                              ))
#+END_SRC
