docs/config.html
<div id="outline-container-org9033e1a" class="outline-4">
<h4 id="org9033e1a"><span class="section-number-4">0.7.5</span> Org Rifle</h4>
<div class="outline-text-4" id="text-0-7-5">
<p>
This probably needs to be refactored later. Or loaded elsewhere.
The keymaps are defined in the following way:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> helm-org-rifle
  <span style="color: #c678dd;">:after</span> org
  <span style="color: #c678dd;">:general</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:keymaps</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-mode-map</span>
            <span style="color: #c678dd;">:states</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">normal</span>
            <span style="color: #c678dd;">:prefix</span> <span style="color: #dcaeea;">my-leader</span>
            <span style="color: #98be65;">"m r"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Rifle (Helm)"</span><span style="color: #98be65;">)</span>
            <span style="color: #98be65;">"m r b"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>helm-org-rifle-current-buffer <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Rifle buffer"</span><span style="color: #98be65;">)</span>
            <span style="color: #98be65;">"m r e"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>helm-org-rifle <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Rifle every open buffer"</span><span style="color: #98be65;">)</span>
            <span style="color: #98be65;">"m r d"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>helm-org-rifle-directory <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Rifle from org-directory"</span><span style="color: #98be65;">)</span>
            <span style="color: #98be65;">"m r a"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>helm-org-rifle-agenda-files <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Rifle agenda"</span><span style="color: #98be65;">)</span>
            <span style="color: #98be65;">"m r o"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #c678dd;">:ignore</span> t <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Occur (Persistent)"</span><span style="color: #98be65;">)</span>
            <span style="color: #98be65;">"m r o b"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>helm-org-rifle-current-buffer <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Rifle buffer"</span><span style="color: #98be65;">)</span>
            <span style="color: #98be65;">"m r o e"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>helm-org-rifle <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Rifle every open buffer"</span><span style="color: #98be65;">)</span>
            <span style="color: #98be65;">"m r o d"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>helm-org-rifle-directory <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Rifle from org-directory"</span><span style="color: #98be65;">)</span>
            <span style="color: #98be65;">"m r o a"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>helm-org-rifle-agenda-files <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Rifle agenda"</span><span style="color: #98be65;">)</span>
            <span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge34065d" class="outline-4">
<h4 id="orge34065d"><span class="section-number-4">0.7.6</span> Org Mind Map</h4>
<div class="outline-text-4" id="text-0-7-6">
<p>
<a href="https://github.com//theodorewiles/org-mind-map">This</a> is used to create <code>graphiz</code> graphs from <code>org-mode</code> stuff.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> org-mind-map
  <span style="color: #c678dd;">:general</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:keymaps</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-mode-map</span>
            <span style="color: #c678dd;">:states</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">normal</span>
            <span style="color: #c678dd;">:prefix</span> <span style="color: #dcaeea;">my-leader</span>
            <span style="color: #98be65;">"m e m"</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>org-mind-map-write <span style="color: #c678dd;">:wk</span> <span style="color: #98be65;">"Export mind-map"</span><span style="color: #98be65;">)</span> <span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf8b7e0d" class="outline-4">
<h4 id="orgf8b7e0d"><span class="section-number-4">0.7.7</span> Org Download</h4>
<div class="outline-text-4" id="text-0-7-7">
<p>
This is already included in the standard doom setup. However, I was having
trouble with relative exports so I have this one instead. Partially kanged from
<code>doom-emacs</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> org-download
  <span style="color: #c678dd;">:after</span> org
  <span style="color: #c678dd;">:config</span>
<span style="color: #c678dd;">(</span><span style="color: #51afef;">setq-default</span> <span style="color: #dcaeea;">org-download-image-dir</span> <span style="color: #98be65;">"./img/"</span>
              <span style="color: #dcaeea;">org-download-screenshot-method</span> <span style="color: #98be65;">"scrot -s %s"</span>
              <span style="color: #dcaeea;">org-download-method</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">directory</span>
              <span style="color: #dcaeea;">org-download-heading-lvl</span> <span style="color: #da8548; font-weight: bold;">1</span>
              <span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org36d2160" class="outline-4">
<h4 id="org36d2160"><span class="section-number-4">0.7.8</span> Org Drill</h4>
<div class="outline-text-4" id="text-0-7-8">
<p>
This is much easier to work with compared to the Anki mode stuff.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> org-drill
  <span style="color: #c678dd;">:after</span> org<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgeda843c" class="outline-3">
<h3 id="orgeda843c"><span class="section-number-3">0.8</span> Syntax Highlighting</h3>
<div class="outline-text-3" id="text-0-8">
<p>
This section is for setting up major modes for various file formats which are
typically non-standard. These are matched by extensions.
</p>
</div>
<div id="outline-container-org96856e8" class="outline-4">
<h4 id="org96856e8"><span class="section-number-4">0.8.1</span> <span class="todo TODO">TODO</span> Direnv Highlighting</h4>
<div class="outline-text-4" id="text-0-8-1">
<p>
<code>direnv</code> is essentially a specialized bash script. Until I have time to make a
proper font locking mode for it, this should suffice.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">auto-mode-alist</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">append</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"\\.envrc$"</span> . shell-script-mode<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
                              <span style="color: #dcaeea;">auto-mode-alist</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org53b214a" class="outline-4">
<h4 id="org53b214a"><span class="section-number-4">0.8.2</span> PKGBUILD Mode</h4>
<div class="outline-text-4" id="text-0-8-2">
<p>
This is the non <code>doom</code> way of loading this.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #a9a1e1;">autoload</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">pkgbuild-mode</span> <span style="color: #98be65;">"pkgbuild-mode.el"</span> <span style="color: #83898d;">"PKGBUILD mode."</span> t<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">auto-mode-alist</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">append</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"/PKGBUILD$"</span> . pkgbuild-mode<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
                              <span style="color: #dcaeea;">auto-mode-alist</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
I use <code>doom</code>. So.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> pkgbuild-mode
  <span style="color: #c678dd;">:mode</span> <span style="color: #98be65;">"\\PKGBUILD"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1656035" class="outline-4">
<h4 id="org1656035"><span class="section-number-4">0.8.3</span> LAMMPS Mode</h4>
<div class="outline-text-4" id="text-0-8-3">
</div>
<ol class="org-ol">
<li><a id="org69a8a4d"></a>No doom setup<br />
<div class="outline-text-5" id="text-0-8-3-1">
<p>
For most users.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #a9a1e1;">autoload</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">lammps-mode</span> <span style="color: #98be65;">"lammps-mode.el"</span> <span style="color: #83898d;">"LAMMPS mode."</span> t<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">auto-mode-alist</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">append</span>
                              <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"in\\.'"</span> . lammps-mode<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
                              <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"\\.lmp\\'"</span> . lammps-mode<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
                              <span style="color: #dcaeea;">auto-mode-alist</span>
                              <span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
