config.org
**** Doom Version
With macros.
#+BEGIN_SRC emacs-lisp
(use-package! lammps-mode)
(setq auto-mode-alist (append
                              '(("in\\.'" . lammps-mode))
                              '(("\\.lmp\\'" . lammps-mode))
                              auto-mode-alist
                              ))
#+END_SRC
*** Pug Mode
Need better font locking everywhere.
#+BEGIN_SRC emacs-lisp
(use-package! pug-mode
  :mode "\\.pug\\'")
#+END_SRC
*** Conf Mode Files
The ~rc~ files are usually encountered while building android stuff. They are handled
well by ~conf-mode~. Turns out that ~vmd~ files also look just like ~conf-mode~ things...
#+BEGIN_SRC emacs-lisp
(setq auto-mode-alist
             (append
             '(("\\.rc\\'" . conf-mode))
             '(("\\.vmd\\'" . conf-mode))
             auto-mode-alist
             ))
#+END_SRC
*** FORTRAN
Strangely the default settings do not pick up a bunch of fortran files.
#+BEGIN_SRC emacs-lisp
(setq auto-mode-alist
             (append
             '(("\\.F90\\'" . fortran-mode))
             auto-mode-alist
             ))
#+END_SRC
*** JVM Languages
Since ~java+meghnada~, ~clojure~, and ~scala~ are covered by the standard ~doom~ config,
the rest of these need to be loaded here.
#+BEGIN_SRC emacs-lisp
(use-package! kotlin-mode
  :mode "\\.kt\\'")

(use-package! groovy-mode
  :mode "\\.groovy\\'")
#+END_SRC
*** Systemd
For all those user-units.
#+BEGIN_SRC emacs-lisp
(use-package! systemd
  :mode "\\.service\\'")
#+END_SRC
*** Dart Mode
Dart seems like a rather fun C-like language. Sort of fallen on the wayside what
with Golang and what not but still might be worth a shot.
#+BEGIN_SRC emacs-lisp :tangle no
(use-package! dart-mode
  :mode "\\.dart\\'")
#+END_SRC
** Aesthetics
** Dockerfile Mode
[[https://github.com/spotify/dockerfile-mode][This]] package from spotify has support for building things as well as
highlighting Dockerfiles.
#+BEGIN_SRC emacs-lisp
(use-package! dockerfile-mode
  :mode "Dockerfile\\'"
  :config
  (put 'dockerfile-image-name 'safe-local-variable #'stringp)
  )
#+END_SRC
** Functions
*** Org-mode export pdf when saved
This one is to generate pdfs whenever a buffer is saved. Mainly taken from
[[https:https://emacs.stackexchange.com/questions/9893/how-can-i-export-to-latex-every-time-i-save-an-org-mode-buffer][this stack exchange question]].
#+BEGIN_SRC emacs-lisp
(defun haozeke/org-save-and-export-pdf ()
  (if (eq major-mode 'org-mode)
    (org-latex-export-to-pdf t)))
#+END_SRC
*** Org-mode export tex when saved
Similar to the one above, but ~tex~ generation is much faster and this way I can
keep editing my files without waiting for it to finish creating the ~pdf~.
#+BEGIN_SRC emacs-lisp
(defun haozeke/org-save-and-export-tex ()
  (if (eq major-mode 'org-mode)
    (org-latex-export-to-latex t)))
#+END_SRC
*** TODO Caveats
- Minted needs to be setup.
- There are really a lot of optimizations to the above.
