docs/config.html
<li><a id="org7e64683"></a>Doom Version<br />
<div class="outline-text-5" id="text-0-8-3-2">
<p>
With macros.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> lammps-mode<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">auto-mode-alist</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">append</span>
                              <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"in\\.'"</span> . lammps-mode<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
                              <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"\\.lmp\\'"</span> . lammps-mode<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
                              <span style="color: #dcaeea;">auto-mode-alist</span>
                              <span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgd3f5fcd" class="outline-4">
<h4 id="orgd3f5fcd"><span class="section-number-4">0.8.4</span> Pug Mode</h4>
<div class="outline-text-4" id="text-0-8-4">
<p>
Need better font locking everywhere.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> pug-mode
  <span style="color: #c678dd;">:mode</span> <span style="color: #98be65;">"\\.pug\\'"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc4cd6a" class="outline-4">
<h4 id="orgdc4cd6a"><span class="section-number-4">0.8.5</span> Conf Mode Files</h4>
<div class="outline-text-4" id="text-0-8-5">
<p>
The <code>rc</code> files are usually encountered while building android stuff. They are handled
well by <code>conf-mode</code>. Turns out that <code>vmd</code> files also look just like <code>conf-mode</code> things&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">auto-mode-alist</span>
             <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">append</span>
             <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"\\.rc\\'"</span> . conf-mode<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
             <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"\\.vmd\\'"</span> . conf-mode<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
             <span style="color: #dcaeea;">auto-mode-alist</span>
             <span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3496f18" class="outline-4">
<h4 id="org3496f18"><span class="section-number-4">0.8.6</span> FORTRAN</h4>
<div class="outline-text-4" id="text-0-8-6">
<p>
Strangely the default settings do not pick up a bunch of fortran files.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">auto-mode-alist</span>
             <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">append</span>
             <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"\\.F90\\'"</span> . fortran-mode<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
             <span style="color: #dcaeea;">auto-mode-alist</span>
             <span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5874056" class="outline-4">
<h4 id="org5874056"><span class="section-number-4">0.8.7</span> JVM Languages</h4>
<div class="outline-text-4" id="text-0-8-7">
<p>
Since <code>java+meghnada</code>, <code>clojure</code>, and <code>scala</code> are covered by the standard <code>doom</code> config,
the rest of these need to be loaded here.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> kotlin-mode
  <span style="color: #c678dd;">:mode</span> <span style="color: #98be65;">"\\.kt\\'"</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> groovy-mode
  <span style="color: #c678dd;">:mode</span> <span style="color: #98be65;">"\\.groovy\\'"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd711f0c" class="outline-4">
<h4 id="orgd711f0c"><span class="section-number-4">0.8.8</span> Systemd</h4>
<div class="outline-text-4" id="text-0-8-8">
<p>
For all those user-units.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> systemd
  <span style="color: #c678dd;">:mode</span> <span style="color: #98be65;">"\\.service\\'"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5e52ca2" class="outline-4">
<h4 id="org5e52ca2"><span class="section-number-4">0.8.9</span> Dart Mode</h4>
<div class="outline-text-4" id="text-0-8-9">
<p>
Dart seems like a rather fun C-like language. Sort of fallen on the wayside what
with Golang and what not but still might be worth a shot.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> dart-mode
  <span style="color: #c678dd;">:mode</span> <span style="color: #98be65;">"\\.dart\\'"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3c1e574" class="outline-3">
<h3 id="org3c1e574"><span class="section-number-3">0.9</span> Aesthetics</h3>
</div>
<div id="outline-container-orge7b50f3" class="outline-3">
<h3 id="orge7b50f3"><span class="section-number-3">0.10</span> Dockerfile Mode</h3>
<div class="outline-text-3" id="text-0-10">
<p>
<a href="https://github.com/spotify/dockerfile-mode">This</a> package from spotify has support for building things as well as
highlighting Dockerfiles.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> dockerfile-mode
  <span style="color: #c678dd;">:mode</span> <span style="color: #98be65;">"Dockerfile\\'"</span>
  <span style="color: #c678dd;">:config</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">put</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">dockerfile-image-name</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">safe-local-variable</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">stringp</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8d70011" class="outline-3">
<h3 id="org8d70011"><span class="section-number-3">0.11</span> Functions</h3>
<div class="outline-text-3" id="text-0-11">
</div>
<div id="outline-container-org8a5c928" class="outline-4">
<h4 id="org8a5c928"><span class="section-number-4">0.11.1</span> Org-mode export pdf when saved</h4>
<div class="outline-text-4" id="text-0-11-1">
<p>
This one is to generate pdfs whenever a buffer is saved. Mainly taken from
<a href="https:https://emacs.stackexchange.com/questions/9893/how-can-i-export-to-latex-every-time-i-save-an-org-mode-buffer">this stack exchange question</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">haozeke/org-save-and-export-pdf</span> <span style="color: #c678dd;">()</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">eq</span> <span style="color: #dcaeea;">major-mode</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-mode</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #c678dd;">org-latex-export-to-pdf</span> t<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org724e90d" class="outline-4">
<h4 id="org724e90d"><span class="section-number-4">0.11.2</span> Org-mode export tex when saved</h4>
<div class="outline-text-4" id="text-0-11-2">
<p>
Similar to the one above, but <code>tex</code> generation is much faster and this way I can
keep editing my files without waiting for it to finish creating the <code>pdf</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">haozeke/org-save-and-export-tex</span> <span style="color: #c678dd;">()</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">eq</span> <span style="color: #dcaeea;">major-mode</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-mode</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #c678dd;">org-latex-export-to-latex</span> t<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org919841e" class="outline-4">
<h4 id="org919841e"><span class="section-number-4">0.11.3</span> <span class="todo TODO">TODO</span> Caveats</h4>
<div class="outline-text-4" id="text-0-11-3">
<ul class="org-ul">
<li>Minted needs to be setup.</li>
<li>There are really a lot of optimizations to the above.</li>
</ul>
</div>
</div>
