config.org
*** Helper function
Figure out if I can replicate this some other way. Taken from [[https://github.com/sam217pa/emacs-config][sam217pa's github repo]].
#+BEGIN_SRC emacs-lisp
;; this function is used to append multiple elements to the list 'ox-latex
(defun append-to-list (list-var elements)
  "Append ELEMENTS to the end of LIST-VAR. The return value is the new value of LIST-VAR."
  (unless (consp elements) (error "ELEMENTS must be a list"))
  (let ((list (symbol-value list-var)))
    (if list
        (setcdr (last list) elements)
      (set list-var elements)))
(symbol-value list-var))
#+END_SRC
*** Async Command without Buffers
This supresses the output window. Useful for when I do async exports. From [[https://stackoverflow.com/questions/13901955/how-to-avoid-pop-up-of-async-shell-command-buffer-in-emacs][this question]].
#+BEGIN_SRC emacs-lisp
(defun async-shell-command-no-window
    (command)
  (interactive)
  (let
      ((display-buffer-alist
        (list
         (cons
          "\\*Async Shell Command\\*.*"
          (cons #'display-buffer-no-window nil)))))
    (async-shell-command
     command)))
#+END_SRC
*** Smarter Clang Formatting
This is taken from [[https://eklitzke.org/smarter-emacs-clang-format][this blog]].
#+BEGIN_SRC emacs-lisp
(defun haozeke/clang-format-buffer-conditional ()
(interactive)
  "Reformat buffer if .clang-format exists in the projectile root."
  (when (f-exists? (expand-file-name ".clang-format" (projectile-project-root)))
    (+format|buffer)))
#+END_SRC
*** Org-mode export to Markdown
This is a convinience function for working with ~nanoc~.
#+BEGIN_SRC emacs-lisp
(defun haozeke/org-pandoc-markdown (dir &optional pargs)
  "A wrapper to generate yaml metadata markdown files. Takes the output
  directory followed by pandoc arguments"
  (if (not (file-exists-p dir)) (make-directory dir))
  (async-shell-command-no-window
   (concat "pandoc -f org -t markdown -s " pargs " " (buffer-name) " -o "
           dir "/" (file-name-sans-extension (buffer-name)) ".md"))
    )
#+END_SRC
** Projects
These are to help setup org-mode workflows.
#+BEGIN_SRC emacs-lisp
; Make sure it's not set before adding to it
(unless (boundp 'org-publish-project-alist)
  (setq org-publish-project-alist nil))
#+END_SRC
*** dotDoom
This is used to generate plain HTML for my [[https://github.com/HaoZeke/dotDoom][dotDoom repo]]. The setup is taken from
the [[https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html#fn.3][worg documentation]] and [[https://github.com/shishougang/wiki/blob/gh-pages/src/notes-init.el][this repository]]. It so turns out that we can host the
entire thing from the master branch on GitHub, but only if it is in a ~docs/~
subfolder... Plus ~org-html-export-to-html~ does not accept filenames which was
a real bummer.
#+BEGIN_SRC emacs-lisp
; dotDoom stuff
; This is a rather harmless useful variable
(setq dotdoom-root-dir "~/.config/doom/")
(setq dotdoom-publish-dir  (concat dotdoom-root-dir "docs"))
#+END_SRC
Now that the variables are set, we can move on to actually setting up the rest
of the export, this includes my own analytics and stuff. Infact maybe the
analytics would be better handled by offloading the damn thing to [[https://netlify.com][Netlify]],
though their recent changes to the TOS are worrying, so Microsoft owned GitHub
seems to be the better option for now.
