docs/config.html
<div id="outline-container-org8ecd5f2" class="outline-4">
<h4 id="org8ecd5f2"><span class="section-number-4">0.11.4</span> Helper function</h4>
<div class="outline-text-4" id="text-0-11-4">
<p>
Figure out if I can replicate this some other way. Taken from <a href="https://github.com/sam217pa/emacs-config">sam217pa&rsquo;s github repo</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">this function is used to append multiple elements to the list 'ox-latex</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">append-to-list</span> <span style="color: #c678dd;">(</span>list-var elements<span style="color: #c678dd;">)</span>
  <span style="color: #83898d;">"Append ELEMENTS to the end of LIST-VAR. The return value is the new value of </span><span style="color: #ffffff; background-color: brightblack;">L</span><span style="color: #83898d;">IST-VAR."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">unless</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">consp</span> elements<span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">error</span> <span style="color: #98be65;">"ELEMENTS must be a list"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #a9a1e1;">list</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">symbol-value</span> list-var<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">if</span> list
        <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">setcdr</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">last</span> list<span style="color: #c678dd;">)</span> elements<span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">set</span> list-var elements<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
<span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">symbol-value</span> list-var<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org62e815e" class="outline-4">
<h4 id="org62e815e"><span class="section-number-4">0.11.5</span> Async Command without Buffers</h4>
<div class="outline-text-4" id="text-0-11-5">
<p>
This supresses the output window. Useful for when I do async exports. From <a href="https://stackoverflow.com/questions/13901955/how-to-avoid-pop-up-of-async-shell-command-buffer-in-emacs">this question</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">async-shell-command-no-window</span>
    <span style="color: #c678dd;">(</span>command<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span>
      <span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #dcaeea;">display-buffer-alist</span>
        <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">list</span>
         <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">cons</span>
          <span style="color: #98be65;">"\\*Async Shell Command\\*.*"</span>
          <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">cons</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">display-buffer-no-window</span> nil<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #c678dd;">async-shell-command</span>
     command<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f30cb0" class="outline-4">
<h4 id="org7f30cb0"><span class="section-number-4">0.11.6</span> Smarter Clang Formatting</h4>
<div class="outline-text-4" id="text-0-11-6">
<p>
This is taken from <a href="https://eklitzke.org/smarter-emacs-clang-format">this blog</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">haozeke/clang-format-buffer-conditional</span> <span style="color: #c678dd;">()</span>
<span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"Reformat buffer if .clang-format exists in the projectile root."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">when</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">f-exists?</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">expand-file-name</span> <span style="color: #98be65;">".clang-format"</span> <span style="color: #c678dd;">(</span><span style="color: #dcaeea;">projectile-project-root</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span>+format|buffer<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e62a4a" class="outline-4">
<h4 id="org4e62a4a"><span class="section-number-4">0.11.7</span> Org-mode export to Markdown</h4>
<div class="outline-text-4" id="text-0-11-7">
<p>
This is a convinience function for working with <code>nanoc</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">haozeke/org-pandoc-markdown</span> <span style="color: #c678dd;">(</span>dir <span style="color: #ECBE7B;">&amp;optional</span> pargs<span style="color: #c678dd;">)</span>
  <span style="color: #83898d;">"A wrapper to generate yaml metadata markdown files. Takes the output</span>
<span style="color: #83898d;">  directory followed by pandoc arguments"</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">not</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">file-exists-p</span> dir<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">make-directory</span> dir<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">async-shell-command-no-window</span>
   <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #98be65;">"pandoc -f org -t markdown -s "</span> pargs <span style="color: #98be65;">" "</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">buffer-name</span><span style="color: #51afef;">)</span> <span style="color: #98be65;">" -o "</span>
           dir <span style="color: #98be65;">"/"</span> <span style="color: #51afef;">(</span><span style="color: #c678dd;">file-name-sans-extension</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">buffer-name</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #98be65;">".md"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
    <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb7d9fc0" class="outline-3">
<h3 id="orgb7d9fc0"><span class="section-number-3">0.12</span> Projects</h3>
<div class="outline-text-3" id="text-0-12">
<p>
These are to help setup org-mode workflows.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">; </span><span style="color: #5B6268;">Make sure it's not set before adding to it</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">unless</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">boundp</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-publish-project-alist</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-publish-project-alist</span> nil<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgc611b66" class="outline-4">
<h4 id="orgc611b66"><span class="section-number-4">0.12.1</span> dotDoom</h4>
<div class="outline-text-4" id="text-0-12-1">
<p>
This is used to generate plain HTML for my <a href="https://github.com/HaoZeke/dotDoom">dotDoom repo</a>. The setup is taken from
the <a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html#fn.3">worg documentation</a> and <a href="https://github.com/shishougang/wiki/blob/gh-pages/src/notes-init.el">this repository</a>. It so turns out that we can host the
entire thing from the master branch on GitHub, but only if it is in a <code>docs/</code>
subfolder&#x2026; Plus <code>org-html-export-to-html</code> does not accept filenames which was
a real bummer.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">; </span><span style="color: #5B6268;">dotDoom stuff</span>
<span style="color: #5B6268;">; </span><span style="color: #5B6268;">This is a rather harmless useful variable</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> dotdoom-root-dir <span style="color: #98be65;">"~/.config/doom/"</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> dotdoom-publish-dir  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">concat</span> dotdoom-root-dir <span style="color: #98be65;">"docs"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
Now that the variables are set, we can move on to actually setting up the rest
of the export, this includes my own analytics and stuff. Infact maybe the
analytics would be better handled by offloading the damn thing to <a href="https://netlify.com">Netlify</a>,
though their recent changes to the TOS are worrying, so Microsoft owned GitHub
seems to be the better option for now.
</p>
</div>
<ol class="org-ol">
