config.org
**** Org Setup
It turns out that each part of the site which needs a separate publish function
needs to be added to the ~org-publish-project-alist~ so we will define each rule.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-publish-project-alist
      `("dotdoom-org"
         :base-directory ,dotdoom-root-dir
         :publishing-directory ,dotdoom-publish-dir
         :base-extension "org"
         :infojs-opt "view:t toc:t ltoc:t mouse:underline buttons:0 path:https://thomasf.github.io/solarized-css/org-info.min.js"
         :html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://thomasf.github.io/solarized-css/solarized-dark.min.css\" />"
         :recursive t
         :publishing-function org-html-publish-to-html
         :auto-index nil ; I make my own from the readme.org
         ;; :html-head-include-default-style nil ; supresses the rest
         ;; :index-filename "README.org"
         ;; :index-title "index"
         ;; :auto-sitemap t                ; Generate sitemap.org automagically...
         ;; :sitemap-filename "index.org"  ; ... call it sitemap.org (it's the default)...
         ;; :sitemap-title "index"         ; ... with title 'sitemap'.
         :link-home "index.html"))
#+END_SRC
**** Static Content
We will at the very least need the ~.txt~ files to be transferred as is for
keybase.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-publish-project-alist
      `("dotdoom-static"
         :base-directory ,dotdoom-root-dir
         :publishing-directory ,dotdoom-publish-dir
         :base-extension "txt"
         :recursive nil
         :publishing-function org-publish-attachment))
#+END_SRC
**** Inherit and Combine
Now we compose the previous projects, keeping in mind the fact that they are in the
LTR order of preference.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-publish-project-alist
      `("dotdoom"
        :components ("dotdoom-org" "dotdoom-static")
        ))
#+END_SRC
** Hooks
*** TODO Caveats
Move all the hooks to this section if possible.
*** Before Save Hooks
**** CC Mode
Currently I only need to use the clang formatting hook here.
#+BEGIN_SRC emacs-lisp
; The interactive thing is REQUIRED
(defun haozeke/clang-format-buffer-smart-on-save ()
(interactive)
  "Add auto-save hook for clang-format-buffer-smart."
  (add-hook 'before-save-hook 'haozeke/clang-format-buffer-conditional nil t))
; This is a doom-emacs convinience macro
(add-hook! (c-mode c++-mode cc-mode) #'haozeke/clang-format-buffer-smart-on-save)
#+END_SRC
*** Disable Auto RDM
This conflicts with the ArchLinux ~systemctl --user start rdm~ thing.
#+BEGIN_SRC emacs-lisp
; Do not automatically try to run rdm
(remove-hook 'c-mode-common-hook #'+cc|init-rtags)
#+END_SRC
** Safe Evals and Variables
*** Private Variables
These are encrypted with ~gpg~ and are essentially set mostly by ~custom-*~
#+BEGIN_SRC emacs-lisp
(use-package! epa-file
  :demand
  :config
  (epa-file-enable)
  (setq custom-file (concat doom-private-dir "local/private.el.gpg"))
  (load custom-file)
)
#+END_SRC
*** Safe Variables
The problem is that ~packages.el~ isn't being produced by the clever little ugly
commit I tried so, this is a workaround to tangle *any* file to be produced in
~.el~ format in the same location.
**** Tangle
So adding the automatic tangling code doesn't mangle things up everytime you
open emacs. Basically this is adapted from [[https://www.reddit.com/r/emacs/comments/5d4hqq/using_babel_to_put_your_init_file_in_org/][this reddit thread]].
#+BEGIN_SRC emacs-lisp
(add-to-list 'safe-local-variable-values
             '(eval add-hook 'after-save-hook
	                (lambda () (org-babel-tangle))
	                nil t))
#+END_SRC
