docs/config.html
<li><a id="orgf009f80"></a>Org Setup<br />
<div class="outline-text-5" id="text-0-12-1-1">
<p>
It turns out that each part of the site which needs a separate publish function
needs to be added to the <code>org-publish-project-alist</code> so we will define each rule.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-publish-project-alist</span>
      <span style="color: #51afef;">`</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"dotdoom-org"</span>
         <span style="color: #c678dd;">:base-directory</span> ,dotdoom-root-dir
         <span style="color: #c678dd;">:publishing-directory</span> ,dotdoom-publish-dir
         <span style="color: #c678dd;">:base-extension</span> <span style="color: #98be65;">"org"</span>
         <span style="color: #c678dd;">:infojs-opt</span> <span style="color: #98be65;">"view:t toc:t ltoc:t mouse:underline buttons:0 path:https:/</span><span style="color: #ffffff; background-color: brightblack;">/</span><span style="color: #98be65;">thomasf.github.io/solarized-css/org-info.min.js"</span>
         <span style="color: #c678dd;">:html-head</span> <span style="color: #98be65;">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"https://t</span><span style="color: #ffffff; background-color: brightblack;">h</span><span style="color: #98be65;">omasf.github.io/solarized-css/solarized-dark.min.css\" /&gt;"</span>
         <span style="color: #c678dd;">:recursive</span> t
         <span style="color: #c678dd;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #c678dd;">:auto-index</span> nil <span style="color: #5B6268;">; </span><span style="color: #5B6268;">I make my own from the readme.org</span>
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">:html-head-include-default-style nil ; supresses the rest</span>
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">:index-filename "README.org"</span>
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">:index-title "index"</span>
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">:auto-sitemap t                ; Generate sitemap.org automagically.</span><span style="color: #ffffff; background-color: brightblack;">.</span><span style="color: #5B6268;">.</span>
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">:sitemap-filename "index.org"  ; ... call it sitemap.org (it's the d</span><span style="color: #ffffff; background-color: brightblack;">e</span><span style="color: #5B6268;">fault)...</span>
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">:sitemap-title "index"         ; ... with title 'sitemap'.</span>
         <span style="color: #c678dd;">:link-home</span> <span style="color: #98be65;">"index.html"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org8369e40"></a>Static Content<br />
<div class="outline-text-5" id="text-0-12-1-2">
<p>
We will at the very least need the <code>.txt</code> files to be transferred as is for
keybase.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-publish-project-alist</span>
      <span style="color: #51afef;">`</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"dotdoom-static"</span>
         <span style="color: #c678dd;">:base-directory</span> ,dotdoom-root-dir
         <span style="color: #c678dd;">:publishing-directory</span> ,dotdoom-publish-dir
         <span style="color: #c678dd;">:base-extension</span> <span style="color: #98be65;">"txt"</span>
         <span style="color: #c678dd;">:recursive</span> nil
         <span style="color: #c678dd;">:publishing-function</span> org-publish-attachment<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org4dd8780"></a>Inherit and Combine<br />
<div class="outline-text-5" id="text-0-12-1-3">
<p>
Now we compose the previous projects, keeping in mind the fact that they are in the
LTR order of preference.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-publish-project-alist</span>
      <span style="color: #51afef;">`</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"dotdoom"</span>
        <span style="color: #c678dd;">:components</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"dotdoom-org"</span> <span style="color: #98be65;">"dotdoom-static"</span><span style="color: #98be65;">)</span>
        <span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org6bddc24" class="outline-3">
<h3 id="org6bddc24"><span class="section-number-3">0.13</span> Hooks</h3>
<div class="outline-text-3" id="text-0-13">
</div>
<div id="outline-container-org45d4db7" class="outline-4">
<h4 id="org45d4db7"><span class="section-number-4">0.13.1</span> <span class="todo TODO">TODO</span> Caveats</h4>
<div class="outline-text-4" id="text-0-13-1">
<p>
Move all the hooks to this section if possible.
</p>
</div>
</div>
<div id="outline-container-org9691e89" class="outline-4">
<h4 id="org9691e89"><span class="section-number-4">0.13.2</span> Before Save Hooks</h4>
<div class="outline-text-4" id="text-0-13-2">
</div>
<ol class="org-ol">
<li><a id="orge9d273b"></a>CC Mode<br />
<div class="outline-text-5" id="text-0-13-2-1">
<p>
Currently I only need to use the clang formatting hook here.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">; </span><span style="color: #5B6268;">The interactive thing is REQUIRED</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">haozeke/clang-format-buffer-smart-on-save</span> <span style="color: #c678dd;">()</span>
<span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #98be65;">"Add auto-save hook for clang-format-buffer-smart."</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">add-hook</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">before-save-hook</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">haozeke/clang-format-buffer-conditional</span> nil t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #5B6268;">; </span><span style="color: #5B6268;">This is a doom-emacs convinience macro</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">add-hook!</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">c-mode</span> c++-mode cc-mode<span style="color: #c678dd;">)</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">haozeke/clang-format-buffer-smart-on-save</span><span style="color: #51afef; background-color: brightblack;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orga42b48e" class="outline-4">
<h4 id="orga42b48e"><span class="section-number-4">0.13.3</span> Disable Auto RDM</h4>
<div class="outline-text-4" id="text-0-13-3">
<p>
This conflicts with the ArchLinux <code>systemctl --user start rdm</code> thing.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">; </span><span style="color: #5B6268;">Do not automatically try to run rdm</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">remove-hook</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">c-mode-common-hook</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">+cc|init-rtags</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgeeff14f" class="outline-3">
<h3 id="orgeeff14f"><span class="section-number-3">0.14</span> Safe Evals and Variables</h3>
<div class="outline-text-3" id="text-0-14">
</div>
<div id="outline-container-org17861b6" class="outline-4">
<h4 id="org17861b6"><span class="section-number-4">0.14.1</span> Private Variables</h4>
<div class="outline-text-4" id="text-0-14-1">
<p>
These are encrypted with <code>gpg</code> and are essentially set mostly by <code>custom-*</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> epa-file
  <span style="color: #c678dd;">:demand</span>
  <span style="color: #c678dd;">:config</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">epa-file-enable</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">custom-file</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #dcaeea;">doom-private-dir</span> <span style="color: #98be65;">"local/private.el.gpg"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">load</span> <span style="color: #dcaeea;">custom-file</span><span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8d9a60f" class="outline-4">
<h4 id="org8d9a60f"><span class="section-number-4">0.14.2</span> Safe Variables</h4>
<div class="outline-text-4" id="text-0-14-2">
<p>
The problem is that <code>packages.el</code> isn&rsquo;t being produced by the clever little ugly
commit I tried so, this is a workaround to tangle <b>any</b> file to be produced in
<code>.el</code> format in the same location.
</p>
</div>
<ol class="org-ol">
<li><a id="orga023a3e"></a>Tangle<br />
<div class="outline-text-5" id="text-0-14-2-1">
<p>
So adding the automatic tangling code doesn&rsquo;t mangle things up everytime you
open emacs. Basically this is adapted from <a href="https://www.reddit.com/r/emacs/comments/5d4hqq/using_babel_to_put_your_init_file_in_org/">this reddit thread</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">safe-local-variable-values</span>
             <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>eval add-hook <span style="color: #51afef;">'</span><span style="color: #dcaeea;">after-save-hook</span>
                  <span style="color: #98be65;">(</span><span style="color: #51afef;">lambda</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">(</span><span style="color: #c678dd;">org-babel-tangle</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
                  nil t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
