config.org
**** TODO Export
This is a catch all for the eventual ~org-mode~ based multiple target exports.
#+BEGIN_SRC emacs-lisp
(add-to-list 'safe-local-variable-values
                '(eval add-hook 'after-save-hook 'haozeke/org-save-and-export-tex nil t)
                '(eval add-hook 'after-save-hook 'haozeke/org-save-and-export-pdf nil t))
#+END_SRC
**** TODO Caveats
- This actually forms it relative to the exact path. 
  (Gotta move it to the config folder)
- The actual code is much more elegant in every way possible.
- Seriously there has to be  a way to not have to do this.
  
*** TODO Safe Evals
This enables the evaluation of these forms. Read more about this via
~docstrings~ sometime.
#+BEGIN_SRC emacs-lisp :tangle no
(add-to-list 'safe-local-eval-forms (eval add-hook 'after-save-hook haozeke/org-save-and-export))
#+END_SRC
*** Asynchronous Exports
As per this [[https://superuser.com/a/898717/899764][interesting answer on the superuser forums]], I need to set
~org-export-async-init-file~.
#+BEGIN_SRC emacs-lisp
(setq org-export-async-init-file (concat doom-private-dir "local/async-ox.el"))
#+END_SRC
** Troubleshooting
These are strictly temporary hacks to resolve problems until they are fixed
upstream.
#+BEGIN_SRC emacs-lisp
(after! doom-themes
  (remove-hook 'doom-load-theme-hook #'doom-themes-treemacs-config))
#+END_SRC
* Org LaTeX
Portions of this section are to be mirrored in [[file:local/async-ox.el][the async init]] file since. That's
also why here it's better to *not* use very _doom_ specific code. I think it
would be a lot better to just work these into a single literate block instead of
maitaining two different sets of syntax.
*** Async Config
This is essentially the same, only some extra packages are added.
#+BEGIN_SRC emacs-lisp :noweb yes :tangle local/async-ox.el
;;; autoExport.el --- For async exports -*- lexical-binding: t; -*-

(require 'package)
(setq package-enable-at-startup nil)
(package-initialize)

(require 'org)
(require 'ox)
(require 'cl)

;; Feature parity with doom
<<orgConf>>
(provide 'autoExport)
;;; autoExport.el ends here
#+END_SRC
*** Config
This is the part which is exported normally.
#+NAME: orgConf
#+BEGIN_SRC emacs-lisp :noweb yes
(with-eval-after-load 'ox-latex
  <<tex_process>>
  <<common_pkgs>>
  <<tufte_book>>
  <<koma_art>>
)
#+END_SRC
** Shared Preferences
*** Compiler
It makes sense to use ~latexmk~ anyway. This way I can set sane defaults.
#+NAME: tex_process
#+BEGIN_SRC emacs-lisp :tangle none
;; Compiler
(setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdfxe %f"))
#+END_SRC
