docs/config.html
<li><a id="orgeea3b98"></a><span class="todo TODO">TODO</span> Export<br />
<div class="outline-text-5" id="text-0-14-2-2">
<p>
This is a catch all for the eventual <code>org-mode</code> based multiple target exports.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">safe-local-variable-values</span>
                <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>eval add-hook <span style="color: #51afef;">'</span><span style="color: #dcaeea;">after-save-hook</span> <span style="color: #51afef;">'</span>haozeke/org-save-and-export-te<span style="color: #ffffff; background-color: brightblack;">x</span> nil t<span style="color: #c678dd;">)</span>
                <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>eval add-hook <span style="color: #51afef;">'</span><span style="color: #dcaeea;">after-save-hook</span> <span style="color: #51afef;">'</span>haozeke/org-save-and-export-pd<span style="color: #ffffff; background-color: brightblack;">f</span> nil t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgc6f80a3"></a><span class="todo TODO">TODO</span> Caveats<br />
<div class="outline-text-5" id="text-0-14-2-3">
<ul class="org-ul">
<li>This actually forms it relative to the exact path. 
(Gotta move it to the config folder)</li>
<li>The actual code is much more elegant in every way possible.</li>
<li>Seriously there has to be  a way to not have to do this.</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgae7bc62" class="outline-4">
<h4 id="orgae7bc62"><span class="section-number-4">0.14.3</span> <span class="todo TODO">TODO</span> Safe Evals</h4>
<div class="outline-text-4" id="text-0-14-3">
<p>
This enables the evaluation of these forms. Read more about this via
<code>docstrings</code> sometime.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">safe-local-eval-forms</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">eval</span> add-hook <span style="color: #51afef;">'</span><span style="color: #dcaeea;">after-save-hook</span> haozeke/org-<span style="color: #ffffff; background-color: brightblack;">s</span>ave-and-export<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5cdef66" class="outline-4">
<h4 id="org5cdef66"><span class="section-number-4">0.14.4</span> Asynchronous Exports</h4>
<div class="outline-text-4" id="text-0-14-4">
<p>
As per this <a href="https://superuser.com/a/898717/899764">interesting answer on the superuser forums</a>, I need to set
<code>org-export-async-init-file</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-export-async-init-file</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #dcaeea;">doom-private-dir</span> <span style="color: #98be65;">"local/async-ox.el"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge0792f8" class="outline-3">
<h3 id="orge0792f8"><span class="section-number-3">0.15</span> Troubleshooting</h3>
<div class="outline-text-3" id="text-0-15">
<p>
These are strictly temporary hacks to resolve problems until they are fixed
upstream.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> doom-themes
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">remove-hook</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">doom-load-theme-hook</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">doom-themes-treemacs-config</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf6a24e4" class="outline-2">
<h2 id="orgf6a24e4"><span class="section-number-2">1</span> Org LaTeX</h2>
<div class="outline-text-2" id="text-1">
<p>
Portions of this section are to be mirrored in <a href="local/async-ox.el">the async init</a> file since. That&rsquo;s
also why here it&rsquo;s better to <b>not</b> use very <span class="underline">doom</span> specific code. I think it
would be a lot better to just work these into a single literate block instead of
maitaining two different sets of syntax.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">with-eval-after-load</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">ox-latex</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-latex-pdf-process</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">list</span> <span style="color: #98be65;">"latexmk -shell-escape -bibtex -f -pdfxe %f"</span><span style="color: #98be65; background-color: brightblack;">)</span><span style="color: #c678dd;">)</span>
