local/async-ox.el
;;; autoExport.el --- For async exports -*- lexical-binding: t; -*-

(require 'package)
(setq package-enable-at-startup nil)
(package-initialize)

(require 'org)
(require 'ox)
(require 'cl)

;; Feature parity with doom
(with-eval-after-load 'ox-latex
  ;; Compiler
  (setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdfxe %f"))
  ;; Configuration
