config.org
*** Packages
Some of these are damn near universal given my set up, so they are declared here.
#+NAME: common_pkgs
#+BEGIN_SRC emacs-lisp :tangle none
;; Configuration
(add-to-list 'org-latex-packages-alist '("" "minted" "xcolor"))
(setq org-latex-listings 'minted)
(setq org-latex-minted-options
  '(("bgcolor" "black") ("linenos" "true") ("style" "native")))
#+END_SRC
** Export Templates
Most of the configuration is to be moved into the file snippets. However, class
definitions and other packages are still to be loaded here. Though here in the ~config.el~ I could use ~doom~ semantics and might as
well to keep things DRY, it appears that the [[file:local/async-ox.el][async file]] needs to keep things in
the old syntax.
*** KOMA Article
Inspired by the post [[https://tex.stackexchange.com/a/364982/130845][here]].
#+NAME: koma_art
#+BEGIN_SRC emacs-lisp :tangle none
(add-to-list 'org-latex-classes
             '("koma-article" "\\documentclass{scrartcl}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+END_SRC
*** Tufte Book
This is really ad-hoc right now and from [[https://www.reddit.com/r/emacs/comments/54g578/anyone_go_from_using_latex_to_org_mode/][this reddit thread]].
#+NAME: tufte_book
#+BEGIN_SRC emacs-lisp :tangle none
(append-to-list
 'org-latex-classes
 '(("tufte-book"
    "\\documentclass[a4paper, sfsidenotes, openany, justified]{tufte-book}
    \\input{/home/haozeke/Git/tufte-book.tex}"
    ("\\part{%s}" . "\\part*{%s}")
    ("\\chapter{%s}" . "\\chapter*{%s}")
    ("\\section{%s}" . "\\section*{%s}")
    ("utf8" . "utf8x")
    ("\\subsection{%s}" . "\\subsection*{%s}"))))
#+END_SRC
** LaTeX Preview for Org mode
Basically I need to see math and physics. Originally borrowed from [[https://emacs.stackexchange.com/questions/30341/how-do-i-customize-the-process-that-gets-triggered-in-org-preview-latex-fragment][this
stackexchange]] question.
