config.org
**** Process
#+BEGIN_SRC emacs-lisp
'(org-preview-latex-process-alist
       (quote
       ((dvipng :programs
         ("lualatex" "dvipng")
         :description "dvi > png" :message "you need to install the programs: latex and dvipng." :image-input-type "dvi" :image-output-type "png" :image-size-adjust
         (1.0 . 1.0)
         :latex-compiler
         ("lualatex -output-format dvi -interaction nonstopmode -output-directory %o %f")
         :image-converter
         ("dvipng -fg %F -bg %B -D %D -T tight -o %O %f"))
 (dvisvgm :programs
          ("latex" "dvisvgm")
          :description "dvi > svg" :message "you need to install the programs: latex and dvisvgm." :use-xcolor t :image-input-type "xdv" :image-output-type "svg" :image-size-adjust
          (1.7 . 1.5)
          :latex-compiler
          ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")
          :image-converter
          ("dvisvgm %f -n -b min -c %S -o %O"))
 (imagemagick :programs
              ("latex" "convert")
              :description "pdf > png" :message "you need to install the programs: latex and imagemagick." :use-xcolor t :image-input-type "pdf" :image-output-type "png" :image-size-adjust
              (1.0 . 1.0)
              :latex-compiler
              ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")
              :image-converter
              ("convert -density %D -trim -antialias %f -quality 100 %O")))))
#+END_SRC
**** Packages
These are required to view math properly.
** Math support
This is from [[https://www.reddit.com/r/emacs/comments/8tjgtu/cdlatex_and_general_latex_completion_with_company/][this reddit]] thread.
#+BEGIN_SRC emacs-lisp
(use-package! cdlatex
    :after (:any org-mode LaTeX-mode)
    :hook
    ((LaTeX-mode . turn-on-cdlatex)
     (org-mode . turn-on-org-cdlatex)))

(use-package! company-math
    :after (:any org-mode TeX-mode)
    :config
    (set-company-backend! 'org-mode 'company-math-symbols-latex)
    (set-company-backend! 'TeX-mode 'company-math-symbols-latex)
    (set-company-backend! 'org-mode 'company-latex-commands)
    (set-company-backend! 'TeX-mode 'company-latex-commands)
    (setq company-tooltip-align-annotations t)
    (setq company-math-allow-latex-symbols-in-faces t))
#+END_SRC
# TODO Add more stuff about the maxima hint from [[https://www.reddit.com/r/emacs/comments/75fp3d/taking_university_notes_in_orgmode_latex/][this reddit thread]].
** Flycheck Additions
These are basically meant to aid in development. The relevant linters are also
added here.
*** MELPA Helpers
This includes settings for both flycheck and the packages it needs.
#+BEGIN_SRC emacs-lisp
(use-package! flycheck-package
  :after flycheck
  :config (flycheck-package-setup))
#+END_SRC
** TODO References
*** Basic Setup
This is a standard [[https://github.com/jkitchin/org-ref][org-ref]] setup.
#+BEGIN_SRC emacs-lisp :tangle no
;; see org-ref for use of these variables
(setq org-ref-bibliography-notes "~/Documents/References/notes.org"
      org-ref-default-bibliography '("~/Documents/References/zotero.bib")
      org-ref-pdf-directory "~/Documents/References/bibtex-pdfs/")

(setq bibtex-completion-notes-path "~/Documents/References/notes.org"
      bibtex-completion-bibliography '("~/Documents/References/zotero.bib")
      bibtex-completion-library-directory "~/Documents/References/bibtex-pdfs/")
#+END_SRC
+I don't actually use ~org-ref-pdf-directory~ or ~org-ref-bibliography-notes~ so
I should change those soon.+
Depreciated in favor of a better setup.
