docs/config.html
<li><a id="orgd07d6c7"></a>Process<br />
<div class="outline-text-5" id="text-1-3-0-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">'</span><span style="color: #51afef;">(</span><span style="color: #dcaeea;">org-preview-latex-process-alist</span>
       <span style="color: #c678dd;">(</span><span style="color: #51afef;">quote</span>
       <span style="color: #98be65;">(</span><span style="color: #51afef;">(</span>dvipng <span style="color: #c678dd;">:programs</span>
         <span style="color: #c678dd;">(</span><span style="color: #98be65;">"lualatex"</span> <span style="color: #98be65;">"dvipng"</span><span style="color: #c678dd;">)</span>
         <span style="color: #c678dd;">:description</span> <span style="color: #98be65;">"dvi &gt; png"</span> <span style="color: #c678dd;">:message</span> <span style="color: #98be65;">"you need to install the programs: la</span><span style="color: #ffffff; background-color: brightblack;">t</span><span style="color: #98be65;">ex and dvipng."</span> <span style="color: #c678dd;">:image-input-type</span> <span style="color: #98be65;">"dvi"</span> <span style="color: #c678dd;">:image-output-type</span> <span style="color: #98be65;">"png"</span> <span style="color: #c678dd;">:image-size-adjust</span>
         <span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">1.0</span> . <span style="color: #da8548; font-weight: bold;">1.0</span><span style="color: #c678dd;">)</span>
         <span style="color: #c678dd;">:latex-compiler</span>
         <span style="color: #c678dd;">(</span><span style="color: #98be65;">"lualatex -output-format dvi -interaction nonstopmode -output-director</span><span style="color: #ffffff; background-color: brightblack;">y</span><span style="color: #98be65;"> %o %f"</span><span style="color: #c678dd;">)</span>
         <span style="color: #c678dd;">:image-converter</span>
         <span style="color: #c678dd;">(</span><span style="color: #98be65;">"dvipng -fg %F -bg %B -D %D -T tight -o %O %f"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
 <span style="color: #51afef;">(</span>dvisvgm <span style="color: #c678dd;">:programs</span>
          <span style="color: #c678dd;">(</span><span style="color: #98be65;">"latex"</span> <span style="color: #98be65;">"dvisvgm"</span><span style="color: #c678dd;">)</span>
          <span style="color: #c678dd;">:description</span> <span style="color: #98be65;">"dvi &gt; svg"</span> <span style="color: #c678dd;">:message</span> <span style="color: #98be65;">"you need to install the programs: l</span><span style="color: #ffffff; background-color: brightblack;">a</span><span style="color: #98be65;">tex and dvisvgm."</span> <span style="color: #c678dd;">:use-xcolor</span> t <span style="color: #c678dd;">:image-input-type</span> <span style="color: #98be65;">"xdv"</span> <span style="color: #c678dd;">:image-output-type</span> <span style="color: #98be65;">"svg"</span> <span style="color: #c678dd;">:image-size-adjust</span>
          <span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">1.7</span> . <span style="color: #da8548; font-weight: bold;">1.5</span><span style="color: #c678dd;">)</span>
          <span style="color: #c678dd;">:latex-compiler</span>
          <span style="color: #c678dd;">(</span><span style="color: #98be65;">"xelatex -no-pdf -interaction nonstopmode -output-directory %o %f"</span><span style="color: #c678dd;">)</span>
          <span style="color: #c678dd;">:image-converter</span>
          <span style="color: #c678dd;">(</span><span style="color: #98be65;">"dvisvgm %f -n -b min -c %S -o %O"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
 <span style="color: #51afef;">(</span>imagemagick <span style="color: #c678dd;">:programs</span>
              <span style="color: #c678dd;">(</span><span style="color: #98be65;">"latex"</span> <span style="color: #98be65;">"convert"</span><span style="color: #c678dd;">)</span>
              <span style="color: #c678dd;">:description</span> <span style="color: #98be65;">"pdf &gt; png"</span> <span style="color: #c678dd;">:message</span> <span style="color: #98be65;">"you need to install the program</span><span style="color: #ffffff; background-color: brightblack;">s</span><span style="color: #98be65;">: latex and imagemagick."</span> <span style="color: #c678dd;">:use-xcolor</span> t <span style="color: #c678dd;">:image-input-type</span> <span style="color: #98be65;">"pdf"</span> <span style="color: #c678dd;">:image-output-type</span> <span style="color: #98be65;">"png"</span> <span style="color: #c678dd;">:image-size-adjust</span>
              <span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">1.0</span> . <span style="color: #da8548; font-weight: bold;">1.0</span><span style="color: #c678dd;">)</span>
              <span style="color: #c678dd;">:latex-compiler</span>
              <span style="color: #c678dd;">(</span><span style="color: #98be65;">"xelatex -no-pdf -interaction nonstopmode -output-directory %o %f</span><span style="color: #ffffff; background-color: brightblack;">"</span><span style="color: #c678dd;">)</span>
              <span style="color: #c678dd;">:image-converter</span>
              <span style="color: #c678dd;">(</span><span style="color: #98be65;">"convert -density %D -trim -antialias %f -quality 100 %O"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org9d10c7b"></a>Packages<br />
<div class="outline-text-5" id="text-1-3-0-2">
<p>
These are required to view math properly.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org09cb540" class="outline-3">
<h3 id="org09cb540"><span class="section-number-3">1.4</span> Math support</h3>
<div class="outline-text-3" id="text-1-4">
<p>
This is from <a href="https://www.reddit.com/r/emacs/comments/8tjgtu/cdlatex_and_general_latex_completion_with_company/">this reddit</a> thread.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> cdlatex
    <span style="color: #c678dd;">:after</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:any</span> org-mode LaTeX-mode<span style="color: #c678dd;">)</span>
    <span style="color: #c678dd;">:hook</span>
    <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #c678dd;">LaTeX-mode</span> . turn-on-cdlatex<span style="color: #98be65;">)</span>
     <span style="color: #98be65;">(</span><span style="color: #c678dd;">org-mode</span> . turn-on-org-cdlatex<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> company-math
    <span style="color: #c678dd;">:after</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:any</span> org-mode TeX-mode<span style="color: #c678dd;">)</span>
    <span style="color: #c678dd;">:config</span>
    <span style="color: #c678dd;">(</span><span style="color: #c678dd;">set-company-backend!</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-mode</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">company-math-symbols-latex</span><span style="color: #c678dd;">)</span>
    <span style="color: #c678dd;">(</span><span style="color: #c678dd;">set-company-backend!</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">TeX-mode</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">company-math-symbols-latex</span><span style="color: #c678dd;">)</span>
    <span style="color: #c678dd;">(</span><span style="color: #c678dd;">set-company-backend!</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-mode</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">company-latex-commands</span><span style="color: #c678dd;">)</span>
    <span style="color: #c678dd;">(</span><span style="color: #c678dd;">set-company-backend!</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">TeX-mode</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">company-latex-commands</span><span style="color: #c678dd;">)</span>
    <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">company-tooltip-align-annotations</span> t<span style="color: #c678dd;">)</span>
    <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> company-math-allow-latex-symbols-in-faces t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1629e30" class="outline-3">
<h3 id="org1629e30"><span class="section-number-3">1.5</span> Flycheck Additions</h3>
<div class="outline-text-3" id="text-1-5">
<p>
These are basically meant to aid in development. The relevant linters are also
added here.
</p>
</div>
<div id="outline-container-orgaeee7d4" class="outline-4">
<h4 id="orgaeee7d4"><span class="section-number-4">1.5.1</span> MELPA Helpers</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
This includes settings for both flycheck and the packages it needs.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> flycheck-package
  <span style="color: #c678dd;">:after</span> flycheck
  <span style="color: #c678dd;">:config</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">flycheck-package-setup</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4cbb38d" class="outline-3">
<h3 id="org4cbb38d"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> References</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orgac30cb0" class="outline-4">
<h4 id="orgac30cb0"><span class="section-number-4">1.6.1</span> Basic Setup</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
This is a standard <a href="https://github.com/jkitchin/org-ref">org-ref</a> setup.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">see org-ref for use of these variables</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> org-ref-bibliography-notes <span style="color: #98be65;">"~/Documents/References/notes.org"</span>
      org-ref-default-bibliography <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"~/Documents/References/zotero.bib"</span><span style="color: #c678dd;">)</span>
      org-ref-pdf-directory <span style="color: #98be65;">"~/Documents/References/bibtex-pdfs/"</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> bibtex-completion-notes-path <span style="color: #98be65;">"~/Documents/References/notes.org"</span>
      bibtex-completion-bibliography <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"~/Documents/References/zotero.bib"</span><span style="color: #c678dd;">)</span>
      bibtex-completion-library-directory <span style="color: #98be65;">"~/Documents/References/bibtex-pdfs/"</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
<del>I don&rsquo;t actually use <code>org-ref-pdf-directory</code> or <code>org-ref-bibliography-notes</code> so
I should change those soon.</del>
Depreciated in favor of a better setup.
</p>
</div>
</div>
