config.org
*** noteYoda
This is largely inspired from [[https://www.reddit.com/r/emacs/comments/4gudyw/help_me_with_my_orgmode_workflow_for_notetaking/][this reddit comment]]. For clarity and extensibility
this will be broken down into a per-package configuration. The heart of this is
an [[https://rclone.org/mega/][rclone mega]] folder to manage all these transparently. With this setup links
to the files are stored in [[https://www.zotero.org/][zotero]] and managed by [[https://github.com/jlegewie/zotfile][zotfile]]. More on this in a post later.
**** Org-Ref
[[https://github.com/jkitchin/org-ref][This]] seems like an ubiquitous choice for working with org files and references.
#+BEGIN_SRC emacs-lisp
(setq org-ref-notes-directory "~/.megaRefs/Notes"
      org-ref-bibliography-notes "~/.megaRefs/articles.org"
      org-ref-default-bibliography '("~/.megaRefs/Bibliographies/zotLib.bib")
      org-ref-pdf-directory "~/.megaRefs/Papers/")
#+END_SRC
Apparently, ~org-ref~ is also able to fetch ~pdf~ files when ~DOI~ or ~URL~
links are dragged onto the ~.bib~ file. However, since ~zotero~ will handle the
metadata, this remains to be considered.
***** Customizing notes
The notes created are not in a form which is used by 
**** Helm-Bibtex
Name aside, [[https://github.com/tmalsburg/helm-bibtex][this]] also works for ~ivy~. Basically meant to interface with
bibliographies in general.
#+BEGIN_SRC emacs-lisp
(setq helm-bibtex-bibliography "~/.megaRefs/Bibliographies/zotLib.bib"
      helm-bibtex-library-path "~/.megaRefs/Papers/"
      helm-bibtex-notes-path "~/.megaRefs/articles.org")
#+END_SRC
**** Org-Noter
I decided to use [[https://github.com/weirdNox/org-noter][org-noter]] over the more commonly described [[https://github.com/rudolfochrist/interleave][interleave]] because
it has better support for working with multiple documents linked to one file.
#+BEGIN_SRC emacs-lisp
(use-package! org-noter
  :after (:any org pdf-view)
  :config
  (setq
   ;; The WM can handle splits
   org-noter-notes-window-location 'other-frame
   ;; Please stop opening frames
   org-noter-always-create-frame nil
   ;; I want to see the whole file
   org-noter-hide-other nil
   ;; Everything is relative to the rclone mega
   ;; org-noter-notes-search-path '("~/.megaRefs/Notes"
   ;;                                  "~/.megaRefs/"
   ;;                                  "~/Documents")
   )
  )
#+END_SRC
*** Reftex
Actually I don't really use ~reftex~ since I'm using heavier tools now, but it
still needs some setup.
#+BEGIN_SRC emacs-lisp
(setq reftex-default-bibliography '("~/.megaRefs/Bibliographies/zotLib.bib"))
#+END_SRC
*** +Org Ref Ivy+
Ivy is used exclusively throughout ~doom~, makes sense to use it here too.
#+BEGIN_SRC emacs-lisp :tangle no
(setq org-ref-completion-library 'org-ref-ivy-cite)
#+END_SRC
Turns out ~helm~ is probably faster for larger collections since it can be
asynchronous. Basically, this is because using the minibuffer, as ivy does is a
blocking action while the ~helm~ buffer may be opened asynchronously.
* Notes
I have a rather involved setup in mind, so I have spun this section off from the
rest. The basic idea is to use [[https://github.com/jrblevin/deft][~deft~]] for short-to-long lookup notes, and
~org-capture~ templates with ~org-protocol~ for the rest. I am also considering
[[https://github.com/hasu/notdeft][notdeft]] since it might work better for what I want to achieve. Though it isn't
really part of a note taking workflow, I also intend to use [[https://github.com/anticodeninja/michel2][michel2]] to sync my
tasks...
** Org Capture
I am not really sure how to use these correctly, but I have the bare minimum
required for the [[https://github.com/sprig/org-capture-extension#set-up-handlers-in-emacs][Firefox browser extension]] (setup [[http://www.mediaonfire.com/blog/2017_07_21_org_protocol_firefox.html][from here]]), and a random
article thing.
*** Functions
These are needed for ~org-capture~ alone for now.
#+BEGIN_SRC emacs-lisp
;; Fix some link issues
(defun transform-square-brackets-to-round-ones(string-to-transform)
  "Transforms [ into ( and ] into ), other chars left unchanged."
  (concat
   (mapcar #'(lambda (c) (if (equal c ?\[) ?\( (if (equal c ?\]) ?\) c))) string-to-transform))
  )
#+END_SRC
