docs/config.html
<div id="outline-container-org86f537e" class="outline-4">
<h4 id="org86f537e"><span class="section-number-4">1.6.2</span> noteYoda</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
This is largely inspired from <a href="https://www.reddit.com/r/emacs/comments/4gudyw/help_me_with_my_orgmode_workflow_for_notetaking/">this reddit comment</a>. For clarity and extensibility
this will be broken down into a per-package configuration. The heart of this is
an <a href="https://rclone.org/mega/">rclone mega</a> folder to manage all these transparently. With this setup links
to the files are stored in <a href="https://www.zotero.org/">zotero</a> and managed by <a href="https://github.com/jlegewie/zotfile">zotfile</a>. More on this in a post later.
</p>
</div>
<ol class="org-ol">
<li><a id="org704d80f"></a>Org-Ref<br />
<div class="outline-text-5" id="text-1-6-2-1">
<p>
<a href="https://github.com/jkitchin/org-ref">This</a> seems like an ubiquitous choice for working with org files and references.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> org-ref-notes-directory <span style="color: #98be65;">"~/.megaRefs/Notes"</span>
      org-ref-bibliography-notes <span style="color: #98be65;">"~/.megaRefs/articles.org"</span>
      org-ref-default-bibliography <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"~/.megaRefs/Bibliographies/zotLib.bib"</span><span style="color: #c678dd;">)</span>
      org-ref-pdf-directory <span style="color: #98be65;">"~/.megaRefs/Papers/"</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
Apparently, <code>org-ref</code> is also able to fetch <code>pdf</code> files when <code>DOI</code> or <code>URL</code>
links are dragged onto the <code>.bib</code> file. However, since <code>zotero</code> will handle the
metadata, this remains to be considered.
</p>
</div>
<ol class="org-ol">
<li><a id="org2ddfc56"></a>Customizing notes<br />
<div class="outline-text-6" id="text-1-6-2-1-1">
<p>
The notes created are not in a form which is used by 
</p>
</div>
</li>
</ol>
</li>
<li><a id="org0e5b47e"></a>Helm-Bibtex<br />
<div class="outline-text-5" id="text-1-6-2-2">
<p>
Name aside, <a href="https://github.com/tmalsburg/helm-bibtex">this</a> also works for <code>ivy</code>. Basically meant to interface with
bibliographies in general.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> helm-bibtex-bibliography <span style="color: #98be65;">"~/.megaRefs/Bibliographies/zotLib.bib"</span>
      helm-bibtex-library-path <span style="color: #98be65;">"~/.megaRefs/Papers/"</span>
      helm-bibtex-notes-path <span style="color: #98be65;">"~/.megaRefs/articles.org"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org85f5694"></a>Org-Noter<br />
<div class="outline-text-5" id="text-1-6-2-3">
<p>
I decided to use <a href="https://github.com/weirdNox/org-noter">org-noter</a> over the more commonly described <a href="https://github.com/rudolfochrist/interleave">interleave</a> because
it has better support for working with multiple documents linked to one file.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> org-noter
  <span style="color: #c678dd;">:after</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:any</span> org pdf-view<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">:config</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span>
   <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">The WM can handle splits</span>
   <span style="color: #dcaeea;">org-noter-notes-window-location</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">other-frame</span>
   <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Please stop opening frames</span>
   <span style="color: #dcaeea;">org-noter-always-create-frame</span> nil
   <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">I want to see the whole file</span>
   <span style="color: #dcaeea;">org-noter-hide-other</span> nil
   <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Everything is relative to the rclone mega</span>
   <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">org-noter-notes-search-path '("~/.megaRefs/Notes"</span>
   <span style="color: #5B6268;">;;                                  </span><span style="color: #5B6268;">"~/.megaRefs/"</span>
   <span style="color: #5B6268;">;;                                  </span><span style="color: #5B6268;">"~/Documents")</span>
   <span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgff1b695" class="outline-4">
<h4 id="orgff1b695"><span class="section-number-4">1.6.3</span> Reftex</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
Actually I don&rsquo;t really use <code>reftex</code> since I&rsquo;m using heavier tools now, but it
still needs some setup.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> reftex-default-bibliography <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"~/.megaRefs/Bibliographies/zotLib.bib"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7e29d98" class="outline-4">
<h4 id="org7e29d98"><span class="section-number-4">1.6.4</span> <del>Org Ref Ivy</del></h4>
<div class="outline-text-4" id="text-1-6-4">
<p>
Ivy is used exclusively throughout <code>doom</code>, makes sense to use it here too.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> org-ref-completion-library <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-ref-ivy-cite</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
Turns out <code>helm</code> is probably faster for larger collections since it can be
asynchronous. Basically, this is because using the minibuffer, as ivy does is a
blocking action while the <code>helm</code> buffer may be opened asynchronously.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org2faa771" class="outline-2">
<h2 id="org2faa771"><span class="section-number-2">2</span> Notes</h2>
<div class="outline-text-2" id="text-2">
<p>
I have a rather involved setup in mind, so I have spun this section off from the
rest. The basic idea is to use <a href="https://github.com/jrblevin/deft"><code>deft</code></a> for short-to-long lookup notes, and
<code>org-capture</code> templates with <code>org-protocol</code> for the rest. I am also considering
<a href="https://github.com/hasu/notdeft">notdeft</a> since it might work better for what I want to achieve. Though it isn&rsquo;t
really part of a note taking workflow, I also intend to use <a href="https://github.com/anticodeninja/michel2">michel2</a> to sync my
tasks&#x2026;
</p>
</div>
<div id="outline-container-orge97166c" class="outline-3">
<h3 id="orge97166c"><span class="section-number-3">2.1</span> Org Capture</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I am not really sure how to use these correctly, but I have the bare minimum
required for the <a href="https://github.com/sprig/org-capture-extension#set-up-handlers-in-emacs">Firefox browser extension</a> (setup <a href="http://www.mediaonfire.com/blog/2017_07_21_org_protocol_firefox.html">from here</a>), and a random
article thing.
</p>
</div>
<div id="outline-container-orgb586ff5" class="outline-4">
<h4 id="orgb586ff5"><span class="section-number-4">2.1.1</span> Functions</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
These are needed for <code>org-capture</code> alone for now.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Fix some link issues</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">transform-square-brackets-to-round-ones</span><span style="color: #c678dd;">(</span>string-to-transform<span style="color: #c678dd;">)</span>
  <span style="color: #83898d;">"Transforms [ into ( and ] into ), other chars left unchanged."</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">concat</span>
   <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">mapcar</span> <span style="color: #51afef;">#'</span><span style="color: #51afef;">(</span>lambda <span style="color: #c678dd;">(</span>c<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">equal</span> c ?\[<span style="color: #98be65;">)</span> ?\( <span style="color: #98be65;">(</span><span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">equal</span> c ?\]<span style="color: #51afef;">)</span> ?\) c<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> string-to-t<span style="color: #ffffff; background-color: brightblack;">r</span>ansform<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
