docs/config.html
<div id="outline-container-org9a3a42e" class="outline-4">
<h4 id="org9a3a42e"><span class="section-number-4">2.1.2</span> Templates</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
This might get complicated but I am only trying to get the bare minimum for
<code>org-protocol</code> right now.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Actually start using templates</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org-capture
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Firefox</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-capture-templates</span>
               <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"P"</span> <span style="color: #98be65;">"Protocol"</span> entry
                 <span style="color: #51afef;">(</span>file+headline <span style="color: #dcaeea;">+org-capture-notes-file</span> <span style="color: #98be65;">"Inbox"</span><span style="color: #51afef;">)</span>
                 <span style="color: #98be65;">"* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n</span><span style="color: #ffffff; background-color: brightblack;">\</span><span style="color: #98be65;">n\n%?"</span>
                 <span style="color: #c678dd;">:prepend</span> t
                 <span style="color: #c678dd;">:kill-buffer</span> t<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-capture-templates</span>
               <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"L"</span> <span style="color: #98be65;">"Protocol Link"</span> entry
                 <span style="color: #51afef;">(</span>file+headline <span style="color: #dcaeea;">+org-capture-notes-file</span> <span style="color: #98be65;">"Inbox"</span><span style="color: #51afef;">)</span>
                 <span style="color: #98be65;">"* %? [[%:link][%(transform-square-brackets-to-round-ones \"%:d</span><span style="color: #ffffff; background-color: brightblack;">e</span><span style="color: #98be65;">scription\")]]\n"</span>
                 <span style="color: #c678dd;">:prepend</span> t
                 <span style="color: #c678dd;">:kill-buffer</span> t<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Misc</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-capture-templates</span>
         <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"a"</span>               <span style="color: #5B6268;">; </span><span style="color: #5B6268;">key</span>
           <span style="color: #98be65;">"Article"</span>         <span style="color: #5B6268;">; </span><span style="color: #5B6268;">name</span>
           entry             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">type</span>
           <span style="color: #51afef;">(</span>file+headline <span style="color: #98be65;">"~/.megaRefs/Notes/consolidated.org"</span> <span style="color: #98be65;">"Article"</span><span style="color: #51afef;">)</span>  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">tar</span><span style="color: #ffffff; background-color: brightblack;">g</span><span style="color: #5B6268;">et</span>
           <span style="color: #98be65;">"* %^{Title} %(org-set-tags)  :article: \n:PROPERTIES:\n:Created: %U\</span><span style="color: #ffffff; background-color: brightblack;">n</span><span style="color: #98be65;">:Linked: %a\n:END:\n%i\nBrief description:\n%?"</span>  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">template</span>
           <span style="color: #c678dd;">:prepend</span> t        <span style="color: #5B6268;">; </span><span style="color: #5B6268;">properties</span>
           <span style="color: #c678dd;">:empty-lines</span> <span style="color: #da8548; font-weight: bold;">1</span>    <span style="color: #5B6268;">; </span><span style="color: #5B6268;">properties</span>
           <span style="color: #c678dd;">:created</span> t        <span style="color: #5B6268;">; </span><span style="color: #5B6268;">properties</span>
           <span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rohit Goswami (HaoZeke) &lt;rohit.goswami@aol.com&gt;</p>
<p class="date">Created: 2019-11-28 Thu 17:07</p>
</div>
</body>
</html>
